# -*- coding: utf-8; -*-


* header
  #+BEGIN_SRC emacs-lisp
    ;; -*-mode: emacs-lisp; coding: utf-8; buffer-read-only: t;-*-
  #+END_SRC

* desktop
  #+BEGIN_SRC emacs-lisp

  ;; desktop 
  (setq desktop-enable t )
  (desktop-load-default)
  (desktop-read)
  (defun desktop-clear-not-modified ()
    "Empty the Desktop.
  desktop-clear 기능중에서 변경되지 않은 파일만을 닫는다."
    (interactive)
    (desktop-lazy-abort)
    (dolist (var desktop-globals-to-clear)
      (if (symbolp var)
        (eval `(setq-default ,var nil))
        (eval `(setq-default ,(car var) ,(cdr var)))))
    (let ((buffers (buffer-list))
          (preserve-regexp (concat "^\\("
                                   (mapconcat (lambda (regexp)
                                                (concat "\\(" regexp "\\)"))
                                              desktop-clear-preserve-buffers
                                              "\\|")
                                   "\\)$")))
      (while buffers
        (let ((bufname (buffer-name (car buffers))))
           (or
             (null bufname)
             (string-match preserve-regexp bufname)
             ;; Don't kill buffers made for internal purposes.
             (and (not (equal bufname "")) (eq (aref bufname 0) ?\s))
             (if (not (buffer-modified-p (car buffers))) (kill-buffer (car buffers)))))
        (setq buffers (cdr buffers))))
    (delete-other-windows))

  (define-key Buffer-menu-mode-map "c" 'desktop-clear-not-modified)
  #+END_SRC
* perf
  #+BEGIN_SRC emacs-lisp
  (remove-hook 'find-file-hooks 'vc-find-file-hook)
  #+END_SRC
* encoding
#+BEGIN_SRC emacs-lisp
  (w32-unix-eval
   (;;(message "win32")
    (prefer-coding-system 'cp949)
    ;; 한글 인코딩을 설정한다. 
    ;;(setq-default default-buffer-file-coding-system 'utf-8 )
    ;;(prefer-coding-system 'cp949)
    ;;(set-default-coding-systems 'cp949)
    (setq-default file-name-coding-system 'cp949)
    (setq-default default-buffer-file-coding-system 'cp949 ))
   ((prefer-coding-system 'utf-8)
    ;; 한글 인코딩을 설정한다. 
    ;;(setq-default default-buffer-file-coding-system 'utf-8 )
    ;;(prefer-coding-system 'cp949)
    (set-default-coding-systems 'utf-8)
    (setq-default file-name-coding-system 'utf-8)
    (setq-default default-buffer-file-coding-system 'utf-8 )))




  ;;; utf-8 설정 
  ;; ;; http://stackoverflow.com/questions/2901541/which-coding-system-should-i-use-in-emacs
  ;; (setq utf-translate-cjk-mode nil) ; disable CJK coding/encoding (Chinese/Japanese/Korean characters)
  ;;   (set-language-environment 'utf-8)
  ;;   (setq locale-coding-system 'utf-8)
  ;;   (set-default-coding-systems 'utf-8)
  ;;   (set-terminal-coding-system 'utf-8)
  ;;   (unless (eq system-type 'windows-nt)
  ;;    (set-selection-coding-system 'utf-8))
  ;;   (prefer-coding-system 'utf-8)

  ;; 외부프로그램 호출할 때 사용하는 encoding 을 결정합니다. 
  ;; 테스트 하는 경우 universal-coding-system-argument 함수를 참고 
  ;; ENCODING 설정방법 
  ;; (modify-coding-system-alist 'process ".*" 'cp949)
  (when-os 'windows-nt
           (modify-coding-system-alist 'process "git\.exe" '(utf-8 . cp949))
           (modify-coding-system-alist 'process "ls\.exe" 'utf-8 )
           (if (and dired-use-ls-dired ls-lisp-use-insert-directory-program)
               (setq-default file-name-coding-system 'utf-8)
             (setq-default file-name-coding-system 'cp949))
           (modify-coding-system-alist 'process "curl\.exe" 'utf-8 ))
  ;;(require 'unicad ) ;;CP949 를 우선 하는 방법을 찾을 것 


  ;;http://superuser.com/questions/325182/how-do-i-set-emacs-character-coding-for-files-in-a-directory
  ;;I'm using Aquamacs, a distro of GNU Emacs 23.3.50.1.
  ;;
  ;;I'm looking at some source files written with some comments in Greek, and they are encoded in CP1253.
  ;;
  ;;And, I can either revert with the proper encoding or I can add a file local variable:
  ;;
  ;;/* -*- mode: c-mode; tab-width: 4; coding: cp1253-unix; -*- */
  ;;
  ;;So I can get them to open properly, and I could certainly tack on file variables to each file.
  ;;
  ;;But I'd like to set the coding for the whole directory. Rather than editing .dir-locals.el by hand, I thought I'd simply:
  ;;
  ;;M-x copy-file-locals-to-dir-locals
  ;;
  ;;From the file that opened correctly. And that generates:
  ;;
  ;;;;; Directory Local Variables
  ;;;;; See Info node `(emacs) Directory Variables' for more information.
  ;;
  ;;((c-mode
  ;;  (tab-width . 4)
  ;;  (coding . cp1253-unix)))
  ;;
  ;;No dice. Yet it clearly recognizes the new tab-width, so it's reading the file.
  ;;
  ;;Any ideas why? And is there any log as emacs is processing the a-list?
  ;;emacs
  ;;share|improve this question
  ;;  
  ;;asked Aug 19 '11 at 9:36
  ;;Ben
  ;;  
  ;;feedback
  ;;migrated from serverfault.com Aug 19 '11 at 11:25
  ;;
  ;;1 Answer
  ;;active oldest votes
  ;;up vote 0 down vote
  ;;  
  ;;
  ;;Unfortunately, it appears that the coding header, by design, does not propagate from Emacs dir-locals; I struggled with your setup, and replicated the issue as well.
  ;;
  ;;Later I came across this source that seems to verify what you found: http://www.emacsmirror.org/package/dir-locals.html
  ;;
  ;;I'm not sure if there is a log for processing the a-list, but in case you aren't familiar with this variable, you can verify your encoding after visiting a file with:
  ;;
  ;;C-h v buffer-file-coding-system RET
  ;;
  ;;or
  ;;
  ;;M-x describe-variable RET buffer-file-coding-system RET
  ;;
  ;;Personally, I think your best bet would be what you already have working - file local variables.
  ;;
  ;;Alternatives I can think of (first is untested) would be to take a look at some of the elisp functions:
  ;;
  ;;(coding-system-priority-list)
  ;;(set-coding-system-priority &rest coding-systems)
  ;;
  ;;OR second: (assuming your directory structure is /something/blah/greekcode/file.c)
  ;;
  ;;(add-to-list 'auto-coding-alist 
  ;;     '("/greekcode/[^/]+.c\\'" . cp1253-unix))
  ;;
  ;;This takes precedence even over file local variables. Modify the regexp as you need, and experiment by evaluating:
  ;;
  ;;(find-auto-coding "/home/brian/greekcode/garbage.c" 1) <= C-x C-e
  ;;
  ;;returns:
  ;;
  ;;(cp1253-unix . auto-coding-alist)
  ;;
  ;;Hopefully this helps! Would love to hear what other emacs users propose as solutions.

  ;;http://www.emacswiki.org/emacs/AutoCodingAlist
  ;; \\ 다음에 ' 이 있음을 주의하라 
  ;;`\`'
  ;;     matches the empty string, but only at the beginning of the string
  ;;     or buffer (or its accessible portion) being matched against.
  ;;
  ;;`\''
  ;;     matches the empty string, but only at the end of the string or
  ;;     buffer (or its accessible portion) being matched against.
  ;;
  ;;deprecatedbynext;;(setq file-coding-system-alist (append '(("\\.js$" . utf-8)) file-coding-system-alist ) ) ;; 자바 스크립트의 인코딩을 UTF-8 로 합니다. 
  (add-to-list 'file-coding-system-alist '("itsalltext" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.rb\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.py\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.org\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.csv\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.json\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.tex\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.sql$" . utf-8))
  (add-to-list 'file-coding-system-alist '("\\.latex\\'" . utf-8))
  (add-to-list 'file-coding-system-alist '("COMMIT_EDITMSG" . utf-8))
  ;;deprecated;; (add-to-list 'auto-coding-alist '("\\.latex\\'" . utf-8))


  ;;;_ http://www.emacswiki.org/emacs/ChangingEncodings


  ;;ChangingEncodings
  ;;When Emacs reads a file, it determines the encoding, reads the file, decodes it into an internal representation, and stores the coding-system used in a variable to be used when saving the file. When saving, the buffer is encoded using the stored coding-system and written to the file again.
  ;;
  ;;You can change the encoding to use for the file when saving using ‘C-x C-m f’. You can also force this immediately by using ‘C-x C-m c <encoding> RET C-x C-w RET’.
  ;;
  ;;You can force Emacs to read a file in a specific encoding with ‘C-x RET c C-x C-f’. If you opened a file and EMACS determined the encoding incorrectly, you can use ‘M-x revert-buffer-with-coding-system’, to reload the file with a named encoding.
  ;;
  ;;For characters covered by ISO 8859, you can interconvert most encodings in Emacs 21.3, courtesy of the code in ucs-tables.el.  fx
  ;;
  ;;Maybe some more explanation is needed, here. In an Emacs running in a Latin-1 locale, create a buffer containing the letter ‘’. Save. The modeline indicates Latin-1 via the ‘1’. Now save using ‘C-x C-m c latin-2 RET C-x C-w RET’. The modeline indicates Latin-2 via the ‘2’. Kill the buffer, reopen it. It displays correctly, but the modeline indicates Latin-1 again. When and why did Emacs do the change from Latin-2 back to Latin-1? Does Locale take precedence over ‘C-x C-m c’?
  ;;
  ;;If, in a Latin-1 environment, you visit a non-ASCII file that doesn’t contain bytes in the range #x80 to #x9f, it is decoded as Latin-1 unless its encoding is specified explicitly somehow. The character `’ has the same code point in Latin-1 and Latin-2, which is why it `displays correctly’. See M-x list-charset-chars and C-u C-x =.
  ;;Contents
  ;;Partial Recoding
  ;;Forcing windows-1252 coding
  ;;Partial Recoding
  ;;Sometimes you need to recode parts of a buffer. Here is an example: You are using Gnus to read mail, and somebody sends you a Word document. You use the AntiWord trick to automatically insert the output of antiword into your buffer. Normally, a Gnus “Article” buffer has the coding system undecided. The antiword output might be inserted using the wrong coding system. On my system, I might end up with something like this:
  ;;
  ;;    Mit freundschaftlichen Grssen und den besten Wnschen fr 2004,
  ;;    Aikido Dojo ZrichBut what I want is this:
  ;;
  ;;    Mit freundschaftlichen Grssen und den besten Wnschen fr 2004,
  ;;    Aikido Dojo ZrichIt seems that the process output was decoded as Latin-1 instead of UTF-8. I want to recode it! To that effect, use M-x recode-region. The command recode-region is part of MULE as of Emacs 22.1; here is a surrogate for older Emacsen:
  ;;
  ;;    (defun recode-region (start end &optional coding-system)
  ;;      "Replace the region with a recoded text."
  ;;      (interactive "r\n\zCoding System (utf-8): ")
  ;;      (setq coding-system (or coding-system 'utf-8))
  ;;      (let ((buffer-read-only nil)
  ;;      (text (buffer-substring start end)))
  ;;        (delete-region start end)
  ;;        (insert (decode-coding-string (string-make-unibyte text) coding-system))))Now I can mark the attachment in the buffer and use M-x recode-region to recode it as UTF-8. The important part is that I need to convert the old text into “unibyte” representation. Without it, I will get the bytes used for the emacs-mule coding-system encoded as UTF-8.
  ;;
  ;;Forcing windows-1252 coding
  ;;Symptom: some files that used to be opened with the right coding under Emacs 21 are now opened with raw coding under Emacs 23. This is especially true with some files that had french accents that are now shown with codes such as \340 for “acute a”.
  ;;
  ;;Root cause: unknown.
  ;;
  ;;proposed “Solutions” seen for this problem: this does not work in my case: (prefer-coding-system ‘windows-1252)
  ;;
  ;;Since Emacs is not able to guess the coding for these types of files, here are 3 ways to address the problem.
  ;;
  ;;1) On a file by file basis: reopen the file by forcing the coding with this utility function:
  ;;    (defun has-revisit-file-with-coding-windows-1252 ()
  ;;    "Re-opens currently visited file with the windows-1252 coding. (By: hassansrc at gmail dot com)
  ;;    Example: 
  ;;    the currently opened file has french accents showing as codes such as:
  ;;        french: t\342ches et activit\340s   (\340 is shown as a unique char) 
  ;;    then execute this function: has-revisit-file-with-coding-windows-1252
  ;;      consequence: the file is reopened with the windows-1252 coding with no other action on the part of the user. 
  ;;                   Hopefully, the accents are now shown properly.
  ;;                   Otherwise, find another coding...
  ;;    
  ;;    "
  ;;        (interactive)
  ;;        (let ((coding-system-for-read 'windows-1252)
  ;;        (coding-system-for-write 'windows-1252)
  ;;        (coding-system-require-warning t)
  ;;        (current-prefix-arg nil))
  ;;          (message "has: Reopened file with coding set to windows-1252")
  ;;          (find-alternate-file buffer-file-name)
  ;;          )
  ;;    )Other ways to deal with accents that appear as codes (ex:\340 for acute e) when visiting files: 
  ;;
  ;;2)Intrusive way: put this at the beginning of the specific file that shows the problem :
  ;;    ;;; Emacs 23 is unable to open this file properly:  -*- coding: windows-1252 -*-3) General solution: apply this recipe to all *.txt files (put it in your .emacs file):
  ;;    (modify-coding-system-alist 'file "\\.txt\\'" 'windows-1252)These 3 solutions worked well under Emacs23 on Windows 7.
  ;;
  ;;HassanSrc



  ;;deprecated;;(defun recode-region (start end &optional coding-system)
  ;;deprecated;;  "Replace the region with a recoded text."
  ;;deprecated;;  (interactive "r\n\zCoding System (utf-8): ")
  ;;deprecated;;  (setq coding-system (or coding-system 'utf-8))
  ;;deprecated;;  (let ((buffer-read-only nil)
  ;;deprecated;;      (text (buffer-substring start end)))
  ;;deprecated;;    (delete-region start end)
  ;;deprecated;;    (insert (decode-coding-string (string-make-unibyte text) coding-system))))




  ;; (defun set-default-coding-systems (coding-system)
  ;;   "Set default value of various coding systems to CODING-SYSTEM.
  ;; This sets the following coding systems:
  ;;   o coding system of a newly created buffer
  ;;   o default coding system for terminal output
  ;;   o default coding system for keyboard input
  ;;   o default coding system for subprocess I/O
  ;;   o default coding system for converting file names."
  ;;   (check-coding-system coding-system)
  ;;   ;;(setq-default buffer-file-coding-system coding-system)
  ;;   ;; (set-default-buffer-file-coding-system coding-system)
  ;;   ;; (if default-enable-multibyte-characters
  ;;   ;;     (setq default-file-name-coding-system coding-system))
  ;;   ;; If coding-system is nil, honor that on MS-DOS as well, so
  ;;   ;; that they could reset the terminal coding system.
  ;;   ;; (unless (and (eq window-system 'pc) coding-system)
  ;;   ;;   (setq default-terminal-coding-system coding-system))
  ;;   (set-terminal-coding-system coding-system)
  ;;   ;;(setq default-keyboard-coding-system coding-system)
  ;;   (set-keyboard-coding-system coding-system)
  ;;   (setq default-process-coding-system (cons coding-system coding-system))
  ;;   ;; Refer to coding-system-for-read and coding-system-for-write
  ;;   ;; so that C-x RET c works.
  ;;   (add-hook 'comint-exec-hook
  ;;      `(lambda ()
  ;;         (let ((proc (get-buffer-process (current-buffer))))
  ;;     (set-process-input-coding-system
  ;;      proc (or coding-system-for-read ',coding-system))
  ;;     (set-process-output-coding-system
  ;;      proc (or coding-system-for-write ',coding-system))))
  ;;      'append)
  ;;   (setq file-name-coding-system coding-system))

  ;; (set-default-coding-systems 'utf-8)
#+END_SRC

#+RESULTS:
: ((\.csv\' . utf-8) (COMMIT_EDITMSG . utf-8) (\.latex\' . utf-8) (\.sql$ . utf-8) (\.tex\' . utf-8) (\.json\' . utf-8) (\.org\' . utf-8) (\.py\' . utf-8) (\.rb\' . utf-8) (itsalltext . utf-8) (\.dz\' no-conversion . no-conversion) (\.txz\' no-conversion . no-conversion) (\.xz\' no-conversion . no-conversion) (\.lzma\' no-conversion . no-conversion) (\.lz\' no-conversion . no-conversion) (\.g?z\' no-conversion . no-conversion) (\.\(?:tgz\|svgz\|sifz\)\' no-conversion . no-conversion) (\.tbz2?\' no-conversion . no-conversion) (\.bz2\' no-conversion . no-conversion) (\.Z\' no-conversion . no-conversion) (\.elc\' . utf-8-emacs) (\.el\' . prefer-utf-8) (\.utf\(-8\)?\' . utf-8) (\.xml\' . xml-find-file-coding-system) (\(\`\|/\)loaddefs.el\' raw-text . raw-text-unix) (\.tar\' no-conversion . no-conversion) (\.po[tx]?\'\|\.po\. . po-find-file-coding-system) (\.\(tex\|ltx\|dtx\|drv\)\' . latexenc-find-file-coding-system) ( undecided))
* 오늘의 메시지 

  #+BEGIN_SRC emacs-lisp
    (defface today-message-face
      '((t (:inherit font-lock-warning-face  :height 2.0)))
      "Face for etags candidate"
      )

    (defun today-message (msg &rest args)
      (let ((msg (apply 'format msg args)))
        (put-text-property 0 (length msg) 'font-lock-face 'today-message-face msg)
        msg))

  
  #+END_SRC

  #+RESULTS:
  : today-message

** 일본어 

*** katakana table
    #+BEGIN_SRC emacs-lisp

      (setf
       katakana
       '(
         (ア a 아)
         (イ i 이)
         (ウ u 우)
         (エ e 에)
         (オ o 오)
         (-ャ ya 야)
         (-ュ yu 유)
         (-ョ yo 요)
         (カ ka 카)
         (キ ki 키)
         (ク ku 쿠)
         (ケ ke 케)
         (コ ko 코)
         (キャ kya 캬)
         (キュ kyu 큐)
         (キョ kyo 쿄)
         (ガ ga 가)
         (ギ gi 기)
         (グ gu 구)
         (ゲ ge 게)
         (ゴ go 고)
         (ギャ gya 갸)
         (ギュ gyu 규)
         (ギョ gyo 교)
         (サ sa 사)
         (シ shi 시)
         (ス su 스)
         (セ se 세)
         (ソ so 소)
         (シャ sha 샤)
         (シュ shu 슈)
         (ショ sho 쇼)
         (ザ za 자)
         (ジ ji 지)
         (ズ zu 즈)
         (ゼ ze 제)
         (ゾ zo 조)
         (ジャ ja 자)
         (ジュ ju 주)
         (ジョ jo 조)
         (タ ta 타)
         (チ chi 치)
         (ツ tsu 쓰)
         (テ te 테)
         (ト to 토)
         (チャ cha 차)
         (チュ chu 추)
         (チョ cho 초)
         (ダ da 다)
         (ヂ ji 지)
         (ヅ zu 즈)
         (デ de 데)
         (ド do 도)
         (ヂャ ja 자)
         (ヂュ ju 주)
         (ヂョ jo 조)
         (ナ na 나)
         (ニ ni 니)
         (ヌ nu 누)
         (ネ ne 네)
         (ノ no 노)
         (ニャ nya 냐)
         (ニュ nyu 뉴)
         (ニョ nyo 뇨)
         (ハ ha 하)
         (ヒ hi 히)
         (フ fu 후)
         (ヘ he 헤)
         (ホ ho 호)
         (ヒャ hya 햐)
         (ヒュ hyu 휴)
         (ヒョ hyo 효)
         (バ ba 바)
         (ビ bi 비)
         (ブ bu 부)
         (ベ be 베)
         (ボ bo 보)
         (ビャ bya 뱌)
         (ビュ byu 뷰)
         (ビョ byo 뵤)
         (パ pa 파)
         (ピ pi 피)
         (プ pu 푸)
         (ペ pe 페)
         (ポ po 포)
         (ピャ pya 퍄)
         (ピュ pyu 퓨)
         (ピョ pyo 표)
         (マ ma 마)
         (ミ mi 미)
         (ム mu 무)
         (メ me 메)
         (モ mo 모)
         (ミャ mya 먀)
         (ミュ myu 뮤)
         (ミョ myo 묘)
         (ヤ ya 야)
         (ユ yu 유)
         (ヨ yo 요)
         (ラ ra 라)
         (リ ri 리)
         (ル ru 루)
         (レ re 레)
         (ロ ro 로)
         (リャ rya 랴)
         (リュ ryu 류)
         (リョ ryo 료)
         (ワ wa 와)
         (ヰ wi 이)
         (ヱ we 에)
         (ヲ wo 오)
         (ン n/nn -ㄴ)
         ;;아래의 가타카나는 근현대에 들어 추가된 것으로, 주로 외국어 발음을 표기하는 데 사용한다.
         (イェ ye 예)
         (ウィ wi 위)
         (ウェ we 웨)
         (ヴァ/ヷ va 바)
         (ヴィ/ヸ vi 비)
         (ヴ vu 부)
         (ヴェ/ヹ ve 베)
         (ヴォ/ヺ vo 보)
         (シェ she 셰)
         (チェ che 체)
         (ジェ ヂェ je 제)
         (ティ ti 티)
         (トゥ tu 투)
         (テャ tya 탸)
         (テュ tyu 튜)
         (テョ tyo 툐)
         (ディ di 디)
         (ドゥ du 두)
         (デャ dya 댜)
         (デュ dyu 듀)
         (デョ dyo 됴)
         (ツァ tsa 싸)
         (ツィ tsi 씨)
         (ツェ tse 쎄)
         (ツォ tso 쏘)
         (ツャ tsya 쌰)
         (ツュ tsyu 쓔)
         (ツョ tsyo 쑈)
         (ファ fa 화)
         (フィ fi 휘)
         (フェ fe 훼)
         (フォ fo 호)
         (フャ fya)
         (フュ fyu)
         (フョ fyo)
         ))


    #+END_SRC

    #+RESULTS:
    | Cannot find any of the specified fonts (Source Code Pro)! Font settings may not be correct. | More than one init function found for package helm-make. Previous owner was helm, replacing it with layer ivy. | Auto-evilication could not remap these functions in map `elfeed-search-mode-map': |

*** 오늘의 카타카나 
    #+BEGIN_SRC emacs-lisp
      (setf today-katakana
            (s-join ";" (-map #'symbol-name (nth  (%  (time-to-day-in-year (current-time)) (length  katakana) ) katakana)) ))
      (spacemacs-buffer/warning
       (today-message
        "어제의 카타카나 %s"
        (s-join ";" (-map #'symbol-name (nth    (%  (-  (time-to-day-in-year (current-time)) 1) (length  katakana) )  katakana)) )))
       (spacemacs-buffer/warning
        (today-message "오늘의 카타카나 %s" today-katakana))
    #+END_SRC

    #+RESULTS:
    | Cannot find any of the specified fonts (Source Code Pro)! Font settings may not be correct. | More than one init function found for package helm-make. Previous owner was helm, replacing it with layer ivy. | Auto-evilication could not remap these functions in map `elfeed-search-mode-map': |

** 한자
*** 한자 4급
    #+BEGIN_SRC emacs-lisp
      (setf hanja-grade4
            '(
      "家  : 집가"
      "歌  : 노래가"
      "價  : 값가"
      "可  : 옳을가"
      "加  : 더할가"
      "假  : 거짓가"
      "街  : 거리가"
      "暇  : 틈가"
      "角  : 뿔각"
      "各  : 각각각"
      "覺  : 깨달을각"
      "刻  : 새길각"
      "間  : 사이간"
      "看  : 볼간"
      "簡  : 대쪽간"
      "干  : 방패간"
      "感  : 느낄감"
      "監  : 볼감"
      "減  : 덜감"
      "甘  : 달감"
      "敢  : 감히감"
      "甲  : 갑옷갑"
      "江  : 강강"
      "强  : 강할강"
      "康  : 편안할강"
      "講  : 익힐강"
      "降  : 내릴강"
      "開  : 열개"
      "改  : 고칠개"
      "個  : 낱개"
      "客  : 손객"
      "車  : 수레거"
      "擧  : 들거"
      "去  : 갈거"
      "巨  : 클거"
      "據  : 근거거"
      "拒  : 막을거"
      "居  : 살거"
      "建  : 세울건"
      "件  : 사건건"
      "健  : 튼튼할건"
      "傑  : 뛰어날걸"
      "檢  : 검사할검"
      "儉  : 검소할검"
      "格  : 격식격"
      "擊  : 칠격"
      "激  : 격할격"
      "見  : 볼견"
      "堅  : 굳을견"
      "犬  : 개견"
      "決  : 터질결"
      "結  : 맺을결"
      "潔  : 깨끗할결"
      "缺  : 이지러질결"
      "京  : 서울경"
      "敬  : 공경할경"
      "景  : 볕경"
      "輕  : 가벼울경"
      "競  : 다툴경"
      "經  : 지날경"
      "境  : 지경경"
      "慶  : 경사경"
      "警  : 경계할경"
      "驚  : 놀랄경"
      "傾  : 기울경"
      "更  : 고칠경"
      "鏡  : 거울경"
      "界  : 경계계"
      "計  : 셀계"
      "係  : 맬계"
      "繼  : 이을계"
      "階  : 섬돌계"
      "戒  : 경계할계"
      "季  : 끌계"
      "鷄  : 닭계"
      "系  : 이어맬계"
      "高  : 높을고"
      "苦  : 쓸고"
      "古  : 옛고"
      "告  : 알릴고"
      "考  : 상고할고"
      "固  : 굳을고"
      "故  : 옛고"
      "孤  : 외로울고"
      "庫  : 곳집고"
      "曲  : 굽을곡"
      "穀  : 곡식곡"
      "困  : 괴로울곤"
      "骨  : 뼈골"
      "工  : 장인공"
      "空  : 빌공"
      "公  : 공평할공"
      "功  : 공공"
      "共  : 함께공"
      "孔  : 구멍공"
      "攻  : 칠공"
      "科  : 과정과"
      "果  : 과실과"
      "課  : 매길과"
      "過  : 지날과"
      "關  : 빗장관"
      "觀  : 볼관"
      "官  : 벼슬관"
      "管  : 피리관"
      "光  : 빛광"
      "廣  : 넓을광"
      "鑛  : 쇳돌광"
      "校  : 학교교"
      "敎  : 가르칠교"
      "交  : 사귈교"
      "橋  : 다리교"
      "九  : 아홉구"
      "口  : 입구"
      "球  : 공구"
      "區  : 지경구"
      "舊  : 예구"
      "具  : 갖출구"
      "救  : 건질구"
      "求  : 구할구"
      "究  : 연구할구"
      "句  : 글귀구"
      "構  : 얽을구"
      "國  : 나라국"
      "局  : 판국"
      "軍  : 군사군"
      "郡  : 고을군"
      "君  : 임군군"
      "群  : 무리군"
      "屈  : 굽을굴"
      "宮  : 집궁"
      "窮  : 다할궁"
      "權  : 권세권"
      "勸  : 권할권"
      "卷  : 책권"
      "券  : 문서권"
      "貴  : 귀할귀"
      "歸  : 돌아갈귀"
      "規  : 법규"
      "均  : 고를균"
      "極  : 다할극"
      "劇  : 심할극"
      "根  : 뿌리근"
      "近  : 가까울근"
      "筋  : 힘줄근"
      "勤  : 부지런할근"
      "金  : 쇠금"
      "今  : 이제금"
      "禁  : 금할금"
      "急  : 급할급"
      "級  : 등급급"
      "給  : 넉넉할급"
      "氣  : 기운기"
      "記  : 기록할기"
      "旗  : 깃발기"
      "己  : 자기기"
      "基  : 터기"
      "技  : 재주기"
      "汽  : 증기기"
      "期  : 기약할기"
      "器  : 그릇기"
      "起  : 일어날기"
      "奇  : 기특할기"
      "機  : 틀기"
      "紀  : 벼리기"
      "寄  : 부칠기"
      "吉  : 길할길"
      "暖  : 따뜻할난"
      "難  : 어려울난"
      "南  : 남녘남"
      "男  : 사내남"
      "納  : 바칠납"
      "內  : 안내"
      "女  : 계집녀"
      "年  : 해년"
      "念  : 생각할념"
      "努  : 힘쓸노"
      "怒  : 성낼노"
      "農  : 농사농"
      "能  : 능할능"
      "多  : 많을다"
      "短  : 짧을단"
      "團  : 둥글단"
      "壇  : 단단"
      "斷  : 끊을단"
      "端  : 끝단"
      "單  : 홑단"
      "檀  : 박달나무단"
      "段  : 층계단"
      "達  : 통달할달"
      "談  : 말씀담"
      "擔  : 멜담"
      "答  : 대답할답"
      "堂  : 집당"
      "當  : 마땅당"
      "黨  : 무리당"
      "大  : 큰대"
      "代  : 대신할대"
      "對  : 대답할대"
      "待  : 기다릴대"
      "隊  : 무리대"
      "帶  : 띠대"
      "德  : 덕덕"
      "道  : 길도"
      "圖  : 그림도"
      "度  : 법도"
      "到  : 이를도"
      "島  : 섬도"
      "都  : 도읍도"
      "導  : 인도할도"
      "徒  : 무리도"
      "逃  : 달아날도"
      "盜  : 훔칠도"
      "讀  : 읽을독"
      "獨  : 홀로독"
      "督  : 감독할독"
      "毒  : 독독"
      "東  : 동녘동"
      "動  : 움직일동"
      "洞  : 마을동"
      "同  : 한가지동"
      "冬  : 겨울동"
      "童  : 아이동"
      "銅  : 구리동"
      "頭  : 머리두"
      "豆  : 콩두"
      "斗  : 말두"
      "得  : 얻을득"
      "登  : 오를등"
      "等  : 무리등"
      "燈  : 등잔등"
      "羅  : 벌일라"
      "樂  : 즐거울락"
      "落  : 떨어질락"
      "亂  : 어지러울란"
      "卵  : 알란"
      "覽  : 볼람"
      "朗  : 밝을랑"
      "來  : 올래"
      "冷  : 찰랭"
      "略  : 다스릴략"
      "良  : 어질량"
      "量  : 헤아릴량"
      "兩  : 두량"
      "糧  : 양식량"
      "旅  : 나그네려"
      "麗  : 고울려"
      "慮  : 생각할려"
      "力  : 힘력"
      "歷  : 지낼력"
      "練  : 익힐련"
      "連  : 이을련"
      "列  : 벌일렬"
      "烈  : 매울렬"
      "領  : 거느릴령"
      "令  : 하여금령"
      "例  : 법식례"
      "禮  : 예절례"
      "老  : 늙을로"
      "路  : 길로"
      "勞  : 일할로"
      "綠  : 푸를록"
      "錄  : 기록할록"
      "論  : 말할론"
      "料  : 헤아릴료"
      "龍  : 용룡"
      "類  : 무리류"
      "流  : 흐를류"
      "留  : 머무를류"
      "柳  : 버들류"
      "六  : 여섯륙"
      "陸  : 뭍륙"
      "輪  : 바퀴륜"
      "律  : 법률"
      "里  : 마을리"
      "理  : 다스릴리"
      "利  : 이로울리"
      "李  : 오얏나무리"
      "離  : 떠날리"
      "林  : 수풀림"
      "立  : 설립"
      "馬  : 말마"
      "萬  : 일만만"
      "滿  : 찰만"
      "末  : 끝말"
      "望  : 바랄망"
      "亡  : 망할망"
      "每  : 매양매"
      "賣  : 팔매"
      "買  : 살매"
      "妹  : 누이매"
      "脈  : 줄기맥"
      "面  : 낯면"
      "勉  : 힘쓸면"
      "名  : 이름명"
      "命  : 목숨명"
      "明  : 밝을명"
      "鳴  : 울명"
      "母  : 어미모"
      "毛  : 털모"
      "模  : 본뜰(법)모"
      "木  : 나무목"
      "目  : 눈목"
      "牧  : 칠목"
      "妙  : 묘할묘"
      "墓  : 무덤묘"
      "無  : 없을무"
      "武  : 굳셀무"
      "務  : 힘쓸무"
      "舞  : 춤출무"
      "門  : 문문"
      "文  : 글월문"
      "問  : 물을문"
      "聞  : 들을문"
      "物  : 물건물"
      "米  : 쌀미"
      "美  : 아름다울미"
      "味  : 맛미"
      "未  : 아닐미"
      "民  : 백성민"
      "密  : 빽빽할밀"
      "朴  : 후박나무박"
      "博  : 넓을박"
      "拍  : 칠박"
      "反  : 되돌릴반"
      "半  : 반반"
      "班  : 나눌반"
      "發  : 필발"
      "髮  : 터럭발"
      "方  : 방향방"
      "放  : 놓을방"
      "房  : 방방"
      "防  : 막을방"
      "訪  : ㅤㅊㅏㅊ을방"
      "妨  : 방해할방"
      "倍  : 곱배"
      "配  : 나눌배"
      "背  : 등배"
      "拜  : 절배"
      "白  : 흰백"
      "百  : 일백백"
      "番  : 차례번"
      "罰  : 죄벌"
      "伐  : 칠벌"
      "範  : 법범"
      "犯  : 범할범"
      "法  : 법법"
      "壁  : 벽벽"
      "變  : 변할변"
      "邊  : 가변"
      "辯  : 말씀변"
      "別  : 나눌별"
      "病  : 병병"
      "兵  : 군사병"
      "報  : 갚을보"
      "寶  : 보배보"
      "保  : 지킬보"
      "步  : 걸음보"
      "普  : 넓을보"
      "服  : 옷복"
      "福  : 복복"
      "伏  : 엎드릴복"
      "複  : 겹칠복"
      "本  : 근본본"
      "奉  : 받들봉"
      "父  : 아비부"
      "夫  : 지아비부"
      "部  : 떼부"
      "婦  : 며느리부"
      "富  : 부자부"
      "復  : 회복할복"
      "副  : 버금부"
      "府  : 마을부"
      "否  : 아닐부"
      "負  : 질부"
      "北  : 북녘북"
      "分  : 나눌분"
      "憤  : 분할분"
      "粉  : 가루분"
      "不  : 아니불"
      "佛  : 부처불"
      "比  : 견줄비"
      "鼻  : 코비"
      "費  : 쓸비"
      "備  : 갖출비"
      "悲  : 슬플비"
      "非  : 아닐비"
      "飛  : 날비"
      "&#  : 숨길비"
      "批  : 비평할비"
      "碑  : 돌기둥비"
      "貧  : 가난할빈"
      "氷  : 얼음빙"
      "四  : 넉사"
      "事  : 일사"
      "社  : 단체사"
      "使  : 하여금사"
      "死  : 죽을사"
      "仕  : 벼슬할사"
      "士  : 선비사"
      "史  : 역사사"
      "思  : 생각할사"
      "寫  : 베낄사"
      "査  : 사실할사"
      "謝  : 사례할사"
      "師  : 스승사"
      "舍  : 집사"
      "寺  : 절사"
      "辭  : 말씀사"
      "絲  : 실사"
      "私  : 사사로울사"
      "射  : 쏠사"
      "山  : 뫼산"
      "算  : 셀산"
      "産  : 낳을산"
      "散  : 흩을산"
      "殺  : 죽일살"
      "三  : 석삼"
      "上  : 윗상"
      "相  : 서로상"
      "商  : 헤아릴상"
      "賞  : 상줄상"
      "狀  : 형상상"
      "床  : 상상"
      "常  : 항상상"
      "想  : 생각할상"
      "象  : 코끼리상"
      "傷  : 다칠상"
      "色  : 빛색"
      "生  : 날생"
      "西  : 서녘서"
      "書  : 글(쓸)서"
      "序  : 차례서"
      "夕  : 저녁석"
      "石  : 돌석"
      "席  : 자리석"
      "先  : 먼저선"
      "線  : 줄선"
      "仙  : 신선선"
      "鮮  : 고울선"
      "善  : 착할선"
      "船  : 배선"
      "選  : 가릴선"
      "宣  : 베풀선"
      "雪  : 눈설"
      "說  : 말씀설"
      "設  : 베풀설"
      "舌  : 혀설"
      "姓  : 성성"
      "成  : 이룰성"
      "省  : 살필성"
      "性  : 성품성"
      "誠  : 정성성"
      "聖  : 성스러울성"
      "城  : 재(성)성"
      "聲  : 소리성"
      "星  : 별성"
      "盛  : 담을성"
      "世  : 세상세"
      "歲  : 해세"
      "洗  : 씻을세"
      "勢  : 권세세"
      "細  : 가늘세"
      "稅  : 세금세"
      "小  : 작을소"
      "少  : 적을소"
      "所  : 바소"
      "消  : 사라질소"
      "掃  : 쓸소"
      "笑  : 웃을소"
      "素  : 본디(흴)소"
      "速  : 빠를속"
      "束  : 묶을속"
      "俗  : 풍속속"
      "續  : 이을속"
      "屬  : 엮을속"
      "孫  : 손자손"
      "損  : 덜손"
      "送  : 보낼송"
      "松  : 소나무송"
      "頌  : 기릴송"
      "水  : 물수"
      "手  : 손수"
      "數  : 셈수"
      "樹  : 나무수"
      "首  : 머리수"
      "收  : 거둘수"
      "授  : 줄수"
      "受  : 받을수"
      "修  : 닦을수"
      "守  : 지킬수"
      "秀  : 빼어날수"
      "宿  : 잘숙"
      "肅  : 엄숙할숙"
      "叔  : 아재비숙"
      "順  : 순할순"
      "純  : 순수할순"
      "術  : 재주술"
      "崇  : 높을숭"
      "習  : 익힐습"
      "勝  : 이길승"
      "承  : 받들승"
      "市  : 시장시"
      "時  : 때시"
      "始  : 처음시"
      "示  : 보일시"
      "視  : 볼시"
      "試  : 시험시"
      "詩  : 시시"
      "施  : 베풀시"
      "是  : 옳을시"
      "食  : 먹을식"
      "植  : 심을식"
      "式  : 법식"
      "識  : 알식"
      "息  : 쉴식"
      "信  : 믿을신"
      "身  : 몸신"
      "新  : 새로울신"
      "神  : 귀신신"
      "臣  : 신하신"
      "申  : 펼신"
      "室  : 집실"
      "失  : 잃을실"
      "實  : 열매실"
      "心  : 마음심"
      "深  : 깊을심"
      "十  : 열십"
      "氏  : 성씨씨"
      "兒  : 아이아"
      "惡  : 악할악"
      "安  : 편안할안"
      "案  : 책상안"
      "眼  : 눈안"
      "暗  : 어두울암"
      "壓  : 누를압"
      "愛  : 사랑애"
      "液  : 진액"
      "額  : 이마액"
      "野  : 들야"
      "夜  : 밤야"
      "弱  : 약할약"
      "藥  : 약약"
      "約  : 묶을약"
      "洋  : 큰바다양"
      "陽  : 볕양"
      "養  : 기를양"
      "羊  : 양양"
      "樣  : 모양양"
      "語  : 말씀어"
      "魚  : 고기어"
      "漁  : 고기잡을어"
      "億  : 억억"
      "言  : 말씀언"
      "嚴  : 엄할엄"
      "業  : 업업"
      "餘  : 남을여"
      "如  : 같을여"
      "與  : 줄여"
      "逆  : 거스를역"
      "易  : 바꿀역"
      "域  : 지경역"
      "然  : 그럴연"
      "煙  : 연기연"
      "演  : 멀리흐를연"
      "硏  : 갈연"
      "延  : 늘일연"
      "緣  : 인연연"
      "鉛  : 납연"
      "燃  : 탈연"
      "熱  : 더울열"
      "葉  : 잎엽"
      "英  : 꽃부리영"
      "永  : 길영"
      "榮  : 꽃영"
      "營  : 경영할영"
      "迎  : 맞을영"
      "映  : 비출영"
      "藝  : 심을예"
      "豫  : 미리예"
      "五  : 다섯오"
      "午  : 낮오"
      "誤  : 그르칠오"
      "屋  : 집옥"
      "玉  : 옥옥"
      "溫  : 따뜻할온"
      "完  : 완전할완"
      "王  : 임금왕"
      "往  : 갈왕"
      "外  : 밖외"
      "要  : 중요할요"
      "曜  : 빛날요"
      "謠  : 노래요"
      "浴  : 목욕할욕"
      "勇  : 날랠용"
      "用  : 쓸용"
      "容  : 얼굴용"
      "右  : 오른쪽우"
      "雨  : 비우"
      "友  : 벚우"
      "牛  : 소우"
      "遇  : 만날우"
      "優  : 넉넉할우"
      "郵  : 우편우"
      "運  : 운전할운"
      "雲  : 구름운"
      "雄  : 수컷웅"
      "園  : 동산원"
      "遠  : 멀원"
      "元  : 으뜸원"
      "願  : 원할원"
      "原  : 근원원"
      "院  : 담원"
      "員  : 인원원"
      "圓  : 둥글원"
      "怨  : 원망할원"
      "援  : 도울원"
      "源  : 근원원"
      "月  : 달월"
      "偉  : 클위"
      "位  : 자리위"
      "爲  : 할위"
      "衛  : 지킬위"
      "圍  : 둘레위"
      "危  : 위태할위"
      "威  : 위엄위"
      "委  : 맡길위"
      "慰  : 위로할위"
      "有  : 있을유"
      "由  : 말미암을유"
      "油  : 기름유"
      "遺  : 남길유"
      "乳  : 젖유"
      "遊  : 놀유"
      "儒  : 선비유"
      "育  : 기를육"
      "肉  : 고기육"
      "銀  : 은은"
      "恩  : 은혜은"
      "隱  : 숨길은"
      "音  : 소리음"
      "飮  : 마실음"
      "陰  : 그늘음"
      "邑  : 고을읍"
      "應  : 응할응"
      "意  : 뜻의"
      "醫  : 의원의"
      "衣  : 옷의"
      "義  : 옳을의"
      "議  : 의논할의"
      "依  : 의지할의"
      "疑  : 의심할의"
      "儀  : 거동의"
      "二  : 두이"
      "以  : 써이"
      "耳  : 귀이"
      "移  : 옮길이"
      "異  : 다를이"
      "益  : 더할익"
      "人  : 사람인"
      "因  : 인할인"
      "認  : 알인"
      "印  : 도장인"
      "引  : 끌인"
      "仁  : 어질인"
      "一  : 한일"
      "日  : 날일"
      "任  : 맡길임"
      "入  : 사람인"
      "自  : 스스로자"
      "子  : 아들자"
      "字  : 글자자"
      "者  : 놈자"
      "姿  : 모양자"
      "姉  : 손위누이자"
      "資  : 재물자"
      "昨  : 어제작"
      "作  : 지을작"
      "殘  : 남을잔"
      "雜  : 섞일잡"
      "長  : 길장"
      "場  : 마당장"
      "章  : 글장"
      "將  : 장수장"
      "障  : 가로막을장"
      "壯  : 장할장"
      "腸  : 창자장"
      "裝  : 꾸밀장"
      "&#  : 장려할장"
      "帳  : 장막장"
      "張  : 베풀장"
      "才  : 재주재"
      "在  : 있을재"
      "財  : 재물재"
      "材  : 재목재"
      "災  : 재앙재"
      "再  : 거듭재"
      "爭  : 다툴쟁"
      "貯  : 쌓을저"
      "低  : 낮을저"
      "底  : 밑저"
      "的  : 과녁적"
      "赤  : 붉을적"
      "敵  : 대적할적"
      "適  : 갈적"
      "籍  : 문서적"
      "賊  : 도둑적"
      "績  : 길쌈할적"
      "積  : 쌓을적"
      "電  : 전기전"
      "全  : 완전할전"
      "前  : 앞전"
      "戰  : 싸울전"
      "典  : 법전"
      "傳  : 전할전"
      "展  : 펼전"
      "田  : 밭전"
      "專  : 오로지전"
      "轉  : 구를전"
      "錢  : 돈전"
      "節  : 마디절"
      "切  : 끊을절"
      "絶  : 끊을절"
      "折  : 꺾을절"
      "店  : 가게점"
      "點  : 점점"
      "占  : 점령할점"
      "接  : 사귈접"
      "正  : 바를정"
      "庭  : 뜰정"
      "定  : 정할정"
      "情  : 뜻정"
      "停  : 머무를정"
      "精  : 정할정"
      "程  : 단위정"
      "政  : 정사정"
      "丁  : 고무래정"
      "整  : 가지런할정"
      "靜  : 고요할정"
      "弟  : 아우제"
      "第  : 차례제"
      "題  : 제목제"
      "祭  : 제사제"
      "濟  : 건널제"
      "製  : 지을제"
      "際  : 사이제"
      "制  : 마를제"
      "提  : 끌제"
      "除  : 덜제"
      "帝  : 임금제"
      "祖  : 조상조"
      "朝  : 아침조"
      "調  : 고를조"
      "操  : 잡을조"
      "助  : 도울조"
      "鳥  : 새조"
      "造  : 지을조"
      "早  : 새벽조"
      "條  : 가지조"
      "組  : 끈조"
      "潮  : 밀물조"
      "足  : 발족"
      "族  : 겨레족"
      "尊  : 높을존"
      "存  : 있을존"
      "卒  : 군사졸"
      "種  : 씨종"
      "終  : 마칠종"
      "宗  : 마루종"
      "從  : 좇을종"
      "鐘  : 종종"
      "左  : 왼좌"
      "座  : 자리좌"
      "罪  : 허물죄"
      "主  : 주인주"
      "住  : 살주"
      "注  : 부을주"
      "晝  : 낮주"
      "週  : 돌주"
      "州  : 고을주"
      "走  : 달릴주"
      "周  : 두루주"
      "朱  : 붉을주"
      "酒  : 술주"
      "竹  : 대죽"
      "準  : 준할준"
      "中  : 가운데중"
      "重  : 무거울중"
      "衆  : 무리중"
      "增  : 붙을증"
      "證  : 증거증"
      "紙  : 종이지"
      "地  : 땅지"
      "知  : 알지"
      "止  : 그칠지"
      "至  : 이를지"
      "志  : 뜻지"
      "支  : 가를지"
      "指  : 손가락지"
      "誌  : 기록할지"
      "持  : 가질지"
      "智  : 슬기지"
      "直  : 곧을직"
      "職  : 벼슬직"
      "織  : 짤직"
      "進  : 나아갈진"
      "眞  : 참진"
      "盡  : 다할진"
      "珍  : 보배진"
      "陣  : 진칠진"
      "質  : 바탕질"
      "集  : 모일집"
      "次  : 버금차"
      "差  : 어긋날차"
      "着  : 붙을착"
      "讚  : 기릴찬"
      "察  : 살필찰"
      "參  : 간여할참"
      "窓  : 창창"
      "唱  : 노래창"
      "創  : 비롯할창"
      "採  : 캘채"
      "責  : 꾸짖을책"
      "冊  : 책책"
      "處  : 살처"
      "川  : 내천"
      "千  : 일천천"
      "天  : 하늘천"
      "泉  : 샘천"
      "鐵  : 쇠철"
      "靑  : 푸를청"
      "淸  : 맑을청"
      "請  : 청할청"
      "聽  : 들을청"
      "廳  : 관청청"
      "體  : 몸체"
      "草  : 풀초"
      "初  : 처음초"
      "招  : 부를초"
      "寸  : 마디촌"
      "村  : 마을촌"
      "銃  : 총총"
      "總  : 거느릴총"
      "最  : 가장최"
      "秋  : 가을추"
      "推  : 밀추"
      "祝  : 빌축"
      "築  : 쌓을축"
      "蓄  : 모을축"
      "縮  : 줄일축"
      "春  : 봄춘"
      "出  : 날출"
      "充  : 찰충"
      "蟲  : 벌레충"
      "忠  : 충성충"
      "取  : 취할취"
      "趣  : 뜻취"
      "就  : 이룰취"
      "測  : 헤아릴측"
      "層  : 층층"
      "致  : 이를치"
      "置  : 둘치"
      "齒  : 이치"
      "治  : 다스릴치"
      "則  : 법칙칙"
      "親  : 친할친"
      "七  : 일곱칠"
      "侵  : 범할침"
      "寢  : 잠잘침"
      "針  : 바늘침"
      "稱  : 일컬을칭"
      "快  : 쾌할쾌"
      "打  : 칠타"
      "他  : 다를타"
      "卓  : 높을탁"
      "炭  : 숯탄"
      "彈  : 탄알탄"
      "歎  : 탄식할탄"
      "脫  : 벚을탈"
      "探  : 찾을탐"
      "太  : 클태"
      "態  : 모양태"
      "宅  : 집택"
      "擇  : 가릴택"
      "土  : 흙토"
      "討  : 칠토"
      "通  : 통할통"
      "統  : 거느릴통"
      "痛  : 아플통"
      "退  : 물러날퇴"
      "鬪  : 싸움투"
      "投  : 던질투"
      "特  : 특별할특"
      "波  : 물결파"
      "破  : 깨뜨릴파"
      "派  : 갈래파"
      "板  : 널빤지판"
      "判  : 판가름할판"
      "八  : 여덟팔"
      "敗  : 패할패"
      "便  : 편할편"
      "篇  : 책편"
      "平  : 평평할평"
      "評  : 평할평"
      "閉  : 닫을폐"
      "砲  : 대포포"
      "包  : 쌀포"
      "布  : 베포"
      "胞  : 세포포"
      "暴  : 사나울포"
      "爆  : 터질폭"
      "表  : 겉표"
      "票  : 표표"
      "標  : 표할표"
      "品  : 물건품"
      "風  : 바람풍"
      "豊  : 풍년풍"
      "疲  : 지칠피"
      "避  : 피할피"
      "必  : 반드시필"
      "筆  : 붓필"
      "下  : 아래하"
      "夏  : 여름하"
      "河  : 강하"
      "學  : 배울학"
      "韓  : 한나라한"
      "漢  : 한수한"
      "寒  : 찰한"
      "限  : 한정할한"
      "閑  : 한가할한"
      "恨  : 원통할한"
      "合  : 합할합"
      "港  : 항구항"
      "航  : 배항"
      "抗  : 겨룰항"
      "海  : 바다해"
      "害  : 해칠해"
      "解  : 풀해"
      "核  : 씨핵"
      "幸  : 다행행"
      "行  : 갈행"
      "向  : 향할향"
      "香  : 향기향"
      "鄕  : 시골향"
      "許  : 허락할허"
      "虛  : 빌허"
      "憲  : 법헌"
      "驗  : 시험험"
      "險  : 험할험"
      "革  : 가죽혁"
      "現  : 나타날현"
      "賢  : 어질현"
      "顯  : 나타날현"
      "血  : 피혈"
      "協  : 화합할협"
      "兄  : 형형"
      "形  : 모양형"
      "刑  : 형벌형"
      "惠  : 은혜혜"
      "號  : 부르짖을호"
      "湖  : 호수호"
      "呼  : 부를호"
      "護  : 보호할호"
      "好  : 좋을호"
      "戶  : 지게호"
      "或  : 혹(혹시)혹"
      "混  : 섞을혼"
      "婚  : 혼인할혼"
      "紅  : 붉을홍"
      "火  : 불화"
      "話  : 말할화"
      "花  : 꽃화"
      "和  : 화할화"
      "畵  : 그림화"
      "化  : 될화"
      "貨  : 재물화"
      "華  : 빛날화"
      "確  : 굳을확"
      "患  : 근심환"
      "環  : 고리환"
      "歡  : 기뻐할환"
      "活  : 살활"
      "黃  : 누를황"
      "況  : 상황황"
      "會  : 모일회"
      "回  : 돌회"
      "灰  : 재(석회)회"
      "孝  : 효도효"
      "效  : 본받을효"
      "後  : 뒤후"
      "候  : 기후후"
      "厚  : 두터울후"
      "訓  : 가르칠훈"
      "揮  : 휘두를휘"
      "休  : 쉴휴"
      "凶  : 흉할흉"
      "黑  : 검을흑"
      "吸  : 마실흡"
      "興  : 일어날흥"
      "希  : 바랄희"
      "喜  : 기쁠희"
      ))
    #+END_SRC

    #+RESULTS:
    | 家  : 집가 | 歌  : 노래가 | 價  : 값가 | 可  : 옳을가 | 加  : 더할가 | 假  : 거짓가 | 街  : 거리가 | 暇  : 틈가 | 角  : 뿔각 | 各  : 각각각 | 覺  : 깨달을각 | 刻  : 새길각 | 間  : 사이간 | 看  : 볼간 | 簡  : 대쪽간 | 干  : 방패간 | 感  : 느낄감 | 監  : 볼감 | 減  : 덜감 | 甘  : 달감 | 敢  : 감히감 | 甲  : 갑옷갑 | 江  : 강강 | 强  : 강할강 | 康  : 편안할강 | 講  : 익힐강 | 降  : 내릴강 | 開  : 열개 | 改  : 고칠개 | 個  : 낱개 | 客  : 손객 | 車  : 수레거 | 擧  : 들거 | 去  : 갈거 | 巨  : 클거 | 據  : 근거거 | 拒  : 막을거 | 居  : 살거 | 建  : 세울건 | 件  : 사건건 | 健  : 튼튼할건 | 傑  : 뛰어날걸 | 檢  : 검사할검 | 儉  : 검소할검 | 格  : 격식격 | 擊  : 칠격 | 激  : 격할격 | 見  : 볼견 | 堅  : 굳을견 | 犬  : 개견 | 決  : 터질결 | 結  : 맺을결 | 潔  : 깨끗할결 | 缺  : 이지러질결 | 京  : 서울경 | 敬  : 공경할경 | 景  : 볕경 | 輕  : 가벼울경 | 競  : 다툴경 | 經  : 지날경 | 境  : 지경경 | 慶  : 경사경 | 警  : 경계할경 | 驚  : 놀랄경 | 傾  : 기울경 | 更  : 고칠경 | 鏡  : 거울경 | 界  : 경계계 | 計  : 셀계 | 係  : 맬계 | 繼  : 이을계 | 階  : 섬돌계 | 戒  : 경계할계 | 季  : 끌계 | 鷄  : 닭계 | 系  : 이어맬계 | 高  : 높을고 | 苦  : 쓸고 | 古  : 옛고 | 告  : 알릴고 | 考  : 상고할고 | 固  : 굳을고 | 故  : 옛고 | 孤  : 외로울고 | 庫  : 곳집고 | 曲  : 굽을곡 | 穀  : 곡식곡 | 困  : 괴로울곤 | 骨  : 뼈골 | 工  : 장인공 | 空  : 빌공 | 公  : 공평할공 | 功  : 공공 | 共  : 함께공 | 孔  : 구멍공 | 攻  : 칠공 | 科  : 과정과 | 果  : 과실과 | 課  : 매길과 | 過  : 지날과 | 關  : 빗장관 | 觀  : 볼관 | 官  : 벼슬관 | 管  : 피리관 | 光  : 빛광 | 廣  : 넓을광 | 鑛  : 쇳돌광 | 校  : 학교교 | 敎  : 가르칠교 | 交  : 사귈교 | 橋  : 다리교 | 九  : 아홉구 | 口  : 입구 | 球  : 공구 | 區  : 지경구 | 舊  : 예구 | 具  : 갖출구 | 救  : 건질구 | 求  : 구할구 | 究  : 연구할구 | 句  : 글귀구 | 構  : 얽을구 | 國  : 나라국 | 局  : 판국 | 軍  : 군사군 | 郡  : 고을군 | 君  : 임군군 | 群  : 무리군 | 屈  : 굽을굴 | 宮  : 집궁 | 窮  : 다할궁 | 權  : 권세권 | 勸  : 권할권 | 卷  : 책권 | 券  : 문서권 | 貴  : 귀할귀 | 歸  : 돌아갈귀 | 規  : 법규 | 均  : 고를균 | 極  : 다할극 | 劇  : 심할극 | 根  : 뿌리근 | 近  : 가까울근 | 筋  : 힘줄근 | 勤  : 부지런할근 | 金  : 쇠금 | 今  : 이제금 | 禁  : 금할금 | 急  : 급할급 | 級  : 등급급 | 給  : 넉넉할급 | 氣  : 기운기 | 記  : 기록할기 | 旗  : 깃발기 | 己  : 자기기 | 基  : 터기 | 技  : 재주기 | 汽  : 증기기 | 期  : 기약할기 | 器  : 그릇기 | 起  : 일어날기 | 奇  : 기특할기 | 機  : 틀기 | 紀  : 벼리기 | 寄  : 부칠기 | 吉  : 길할길 | 暖  : 따뜻할난 | 難  : 어려울난 | 南  : 남녘남 | 男  : 사내남 | 納  : 바칠납 | 內  : 안내 | 女  : 계집녀 | 年  : 해년 | 念  : 생각할념 | 努  : 힘쓸노 | 怒  : 성낼노 | 農  : 농사농 | 能  : 능할능 | 多  : 많을다 | 短  : 짧을단 | 團  : 둥글단 | 壇  : 단단 | 斷  : 끊을단 | 端  : 끝단 | 單  : 홑단 | 檀  : 박달나무단 | 段  : 층계단 | 達  : 통달할달 | 談  : 말씀담 | 擔  : 멜담 | 答  : 대답할답 | 堂  : 집당 | 當  : 마땅당 | 黨  : 무리당 | 大  : 큰대 | 代  : 대신할대 | 對  : 대답할대 | 待  : 기다릴대 | 隊  : 무리대 | 帶  : 띠대 | 德  : 덕덕 | 道  : 길도 | 圖  : 그림도 | 度  : 법도 | 到  : 이를도 | 島  : 섬도 | 都  : 도읍도 | 導  : 인도할도 | 徒  : 무리도 | 逃  : 달아날도 | 盜  : 훔칠도 | 讀  : 읽을독 | 獨  : 홀로독 | 督  : 감독할독 | 毒  : 독독 | 東  : 동녘동 | 動  : 움직일동 | 洞  : 마을동 | 同  : 한가지동 | 冬  : 겨울동 | 童  : 아이동 | 銅  : 구리동 | 頭  : 머리두 | 豆  : 콩두 | 斗  : 말두 | 得  : 얻을득 | 登  : 오를등 | 等  : 무리등 | 燈  : 등잔등 | 羅  : 벌일라 | 樂  : 즐거울락 | 落  : 떨어질락 | 亂  : 어지러울란 | 卵  : 알란 | 覽  : 볼람 | 朗  : 밝을랑 | 來  : 올래 | 冷  : 찰랭 | 略  : 다스릴략 | 良  : 어질량 | 量  : 헤아릴량 | 兩  : 두량 | 糧  : 양식량 | 旅  : 나그네려 | 麗  : 고울려 | 慮  : 생각할려 | 力  : 힘력 | 歷  : 지낼력 | 練  : 익힐련 | 連  : 이을련 | 列  : 벌일렬 | 烈  : 매울렬 | 領  : 거느릴령 | 令  : 하여금령 | 例  : 법식례 | 禮  : 예절례 | 老  : 늙을로 | 路  : 길로 | 勞  : 일할로 | 綠  : 푸를록 | 錄  : 기록할록 | 論  : 말할론 | 料  : 헤아릴료 | 龍  : 용룡 | 類  : 무리류 | 流  : 흐를류 | 留  : 머무를류 | 柳  : 버들류 | 六  : 여섯륙 | 陸  : 뭍륙 | 輪  : 바퀴륜 | 律  : 법률 | 里  : 마을리 | 理  : 다스릴리 | 利  : 이로울리 | 李  : 오얏나무리 | 離  : 떠날리 | 林  : 수풀림 | 立  : 설립 | 馬  : 말마 | 萬  : 일만만 | 滿  : 찰만 | 末  : 끝말 | 望  : 바랄망 | 亡  : 망할망 | 每  : 매양매 | 賣  : 팔매 | 買  : 살매 | 妹  : 누이매 | 脈  : 줄기맥 | 面  : 낯면 | 勉  : 힘쓸면 | 名  : 이름명 | 命  : 목숨명 | 明  : 밝을명 | 鳴  : 울명 | 母  : 어미모 | 毛  : 털모 | 模  : 본뜰(법)모 | 木  : 나무목 | 目  : 눈목 | 牧  : 칠목 | 妙  : 묘할묘 | 墓  : 무덤묘 | 無  : 없을무 | 武  : 굳셀무 | 務  : 힘쓸무 | 舞  : 춤출무 | 門  : 문문 | 文  : 글월문 | 問  : 물을문 | 聞  : 들을문 | 物  : 물건물 | 米  : 쌀미 | 美  : 아름다울미 | 味  : 맛미 | 未  : 아닐미 | 民  : 백성민 | 密  : 빽빽할밀 | 朴  : 후박나무박 | 博  : 넓을박 | 拍  : 칠박 | 反  : 되돌릴반 | 半  : 반반 | 班  : 나눌반 | 發  : 필발 | 髮  : 터럭발 | 方  : 방향방 | 放  : 놓을방 | 房  : 방방 | 防  : 막을방 | 訪  : ㅤㅊㅏㅊ을방 | 妨  : 방해할방 | 倍  : 곱배 | 配  : 나눌배 | 背  : 등배 | 拜  : 절배 | 白  : 흰백 | 百  : 일백백 | 番  : 차례번 | 罰  : 죄벌 | 伐  : 칠벌 | 範  : 법범 | 犯  : 범할범 | 法  : 법법 | 壁  : 벽벽 | 變  : 변할변 | 邊  : 가변 | 辯  : 말씀변 | 別  : 나눌별 | 病  : 병병 | 兵  : 군사병 | 報  : 갚을보 | 寶  : 보배보 | 保  : 지킬보 | 步  : 걸음보 | 普  : 넓을보 | 服  : 옷복 | 福  : 복복 | 伏  : 엎드릴복 | 複  : 겹칠복 | 本  : 근본본 | 奉  : 받들봉 | 父  : 아비부 | 夫  : 지아비부 | 部  : 떼부 | 婦  : 며느리부 | 富  : 부자부 | 復  : 회복할복 | 副  : 버금부 | 府  : 마을부 | 否  : 아닐부 | 負  : 질부 | 北  : 북녘북 | 分  : 나눌분 | 憤  : 분할분 | 粉  : 가루분 | 不  : 아니불 | 佛  : 부처불 | 比  : 견줄비 | 鼻  : 코비 | 費  : 쓸비 | 備  : 갖출비 | 悲  : 슬플비 | 非  : 아닐비 | 飛  : 날비 | &#  : 숨길비 | 批  : 비평할비 | 碑  : 돌기둥비 | 貧  : 가난할빈 | 氷  : 얼음빙 | 四  : 넉사 | 事  : 일사 | 社  : 단체사 | 使  : 하여금사 | 死  : 죽을사 | 仕  : 벼슬할사 | 士  : 선비사 | 史  : 역사사 | 思  : 생각할사 | 寫  : 베낄사 | 査  : 사실할사 | 謝  : 사례할사 | 師  : 스승사 | 舍  : 집사 | 寺  : 절사 | 辭  : 말씀사 | 絲  : 실사 | 私  : 사사로울사 | 射  : 쏠사 | 山  : 뫼산 | 算  : 셀산 | 産  : 낳을산 | 散  : 흩을산 | 殺  : 죽일살 | 三  : 석삼 | 上  : 윗상 | 相  : 서로상 | 商  : 헤아릴상 | 賞  : 상줄상 | 狀  : 형상상 | 床  : 상상 | 常  : 항상상 | 想  : 생각할상 | 象  : 코끼리상 | 傷  : 다칠상 | 色  : 빛색 | 生  : 날생 | 西  : 서녘서 | 書  : 글(쓸)서 | 序  : 차례서 | 夕  : 저녁석 | 石  : 돌석 | 席  : 자리석 | 先  : 먼저선 | 線  : 줄선 | 仙  : 신선선 | 鮮  : 고울선 | 善  : 착할선 | 船  : 배선 | 選  : 가릴선 | 宣  : 베풀선 | 雪  : 눈설 | 說  : 말씀설 | 設  : 베풀설 | 舌  : 혀설 | 姓  : 성성 | 成  : 이룰성 | 省  : 살필성 | 性  : 성품성 | 誠  : 정성성 | 聖  : 성스러울성 | 城  : 재(성)성 | 聲  : 소리성 | 星  : 별성 | 盛  : 담을성 | 世  : 세상세 | 歲  : 해세 | 洗  : 씻을세 | 勢  : 권세세 | 細  : 가늘세 | 稅  : 세금세 | 小  : 작을소 | 少  : 적을소 | 所  : 바소 | 消  : 사라질소 | 掃  : 쓸소 | 笑  : 웃을소 | 素  : 본디(흴)소 | 速  : 빠를속 | 束  : 묶을속 | 俗  : 풍속속 | 續  : 이을속 | 屬  : 엮을속 | 孫  : 손자손 | 損  : 덜손 | 送  : 보낼송 | 松  : 소나무송 | 頌  : 기릴송 | 水  : 물수 | 手  : 손수 | 數  : 셈수 | 樹  : 나무수 | 首  : 머리수 | 收  : 거둘수 | 授  : 줄수 | 受  : 받을수 | 修  : 닦을수 | 守  : 지킬수 | 秀  : 빼어날수 | 宿  : 잘숙 | 肅  : 엄숙할숙 | 叔  : 아재비숙 | 順  : 순할순 | 純  : 순수할순 | 術  : 재주술 | 崇  : 높을숭 | 習  : 익힐습 | 勝  : 이길승 | 承  : 받들승 | 市  : 시장시 | 時  : 때시 | 始  : 처음시 | 示  : 보일시 | 視  : 볼시 | 試  : 시험시 | 詩  : 시시 | 施  : 베풀시 | 是  : 옳을시 | 食  : 먹을식 | 植  : 심을식 | 式  : 법식 | 識  : 알식 | 息  : 쉴식 | 信  : 믿을신 | 身  : 몸신 | 新  : 새로울신 | 神  : 귀신신 | 臣  : 신하신 | 申  : 펼신 | 室  : 집실 | 失  : 잃을실 | 實  : 열매실 | 心  : 마음심 | 深  : 깊을심 | 十  : 열십 | 氏  : 성씨씨 | 兒  : 아이아 | 惡  : 악할악 | 安  : 편안할안 | 案  : 책상안 | 眼  : 눈안 | 暗  : 어두울암 | 壓  : 누를압 | 愛  : 사랑애 | 液  : 진액 | 額  : 이마액 | 野  : 들야 | 夜  : 밤야 | 弱  : 약할약 | 藥  : 약약 | 約  : 묶을약 | 洋  : 큰바다양 | 陽  : 볕양 | 養  : 기를양 | 羊  : 양양 | 樣  : 모양양 | 語  : 말씀어 | 魚  : 고기어 | 漁  : 고기잡을어 | 億  : 억억 | 言  : 말씀언 | 嚴  : 엄할엄 | 業  : 업업 | 餘  : 남을여 | 如  : 같을여 | 與  : 줄여 | 逆  : 거스를역 | 易  : 바꿀역 | 域  : 지경역 | 然  : 그럴연 | 煙  : 연기연 | 演  : 멀리흐를연 | 硏  : 갈연 | 延  : 늘일연 | 緣  : 인연연 | 鉛  : 납연 | 燃  : 탈연 | 熱  : 더울열 | 葉  : 잎엽 | 英  : 꽃부리영 | 永  : 길영 | 榮  : 꽃영 | 營  : 경영할영 | 迎  : 맞을영 | 映  : 비출영 | 藝  : 심을예 | 豫  : 미리예 | 五  : 다섯오 | 午  : 낮오 | 誤  : 그르칠오 | 屋  : 집옥 | 玉  : 옥옥 | 溫  : 따뜻할온 | 完  : 완전할완 | 王  : 임금왕 | 往  : 갈왕 | 外  : 밖외 | 要  : 중요할요 | 曜  : 빛날요 | 謠  : 노래요 | 浴  : 목욕할욕 | 勇  : 날랠용 | 用  : 쓸용 | 容  : 얼굴용 | 右  : 오른쪽우 | 雨  : 비우 | 友  : 벚우 | 牛  : 소우 | 遇  : 만날우 | 優  : 넉넉할우 | 郵  : 우편우 | 運  : 운전할운 | 雲  : 구름운 | 雄  : 수컷웅 | 園  : 동산원 | 遠  : 멀원 | 元  : 으뜸원 | 願  : 원할원 | 原  : 근원원 | 院  : 담원 | 員  : 인원원 | 圓  : 둥글원 | 怨  : 원망할원 | 援  : 도울원 | 源  : 근원원 | 月  : 달월 | 偉  : 클위 | 位  : 자리위 | 爲  : 할위 | 衛  : 지킬위 | 圍  : 둘레위 | 危  : 위태할위 | 威  : 위엄위 | 委  : 맡길위 | 慰  : 위로할위 | 有  : 있을유 | 由  : 말미암을유 | 油  : 기름유 | 遺  : 남길유 | 乳  : 젖유 | 遊  : 놀유 | 儒  : 선비유 | 育  : 기를육 | 肉  : 고기육 | 銀  : 은은 | 恩  : 은혜은 | 隱  : 숨길은 | 音  : 소리음 | 飮  : 마실음 | 陰  : 그늘음 | 邑  : 고을읍 | 應  : 응할응 | 意  : 뜻의 | 醫  : 의원의 | 衣  : 옷의 | 義  : 옳을의 | 議  : 의논할의 | 依  : 의지할의 | 疑  : 의심할의 | 儀  : 거동의 | 二  : 두이 | 以  : 써이 | 耳  : 귀이 | 移  : 옮길이 | 異  : 다를이 | 益  : 더할익 | 人  : 사람인 | 因  : 인할인 | 認  : 알인 | 印  : 도장인 | 引  : 끌인 | 仁  : 어질인 | 一  : 한일 | 日  : 날일 | 任  : 맡길임 | 入  : 사람인 | 自  : 스스로자 | 子  : 아들자 | 字  : 글자자 | 者  : 놈자 | 姿  : 모양자 | 姉  : 손위누이자 | 資  : 재물자 | 昨  : 어제작 | 作  : 지을작 | 殘  : 남을잔 | 雜  : 섞일잡 | 長  : 길장 | 場  : 마당장 | 章  : 글장 | 將  : 장수장 | 障  : 가로막을장 | 壯  : 장할장 | 腸  : 창자장 | 裝  : 꾸밀장 | &#  : 장려할장 | 帳  : 장막장 | 張  : 베풀장 | 才  : 재주재 | 在  : 있을재 | 財  : 재물재 | 材  : 재목재 | 災  : 재앙재 | 再  : 거듭재 | 爭  : 다툴쟁 | 貯  : 쌓을저 | 低  : 낮을저 | 底  : 밑저 | 的  : 과녁적 | 赤  : 붉을적 | 敵  : 대적할적 | 適  : 갈적 | 籍  : 문서적 | 賊  : 도둑적 | 績  : 길쌈할적 | 積  : 쌓을적 | 電  : 전기전 | 全  : 완전할전 | 前  : 앞전 | 戰  : 싸울전 | 典  : 법전 | 傳  : 전할전 | 展  : 펼전 | 田  : 밭전 | 專  : 오로지전 | 轉  : 구를전 | 錢  : 돈전 | 節  : 마디절 | 切  : 끊을절 | 絶  : 끊을절 | 折  : 꺾을절 | 店  : 가게점 | 點  : 점점 | 占  : 점령할점 | 接  : 사귈접 | 正  : 바를정 | 庭  : 뜰정 | 定  : 정할정 | 情  : 뜻정 | 停  : 머무를정 | 精  : 정할정 | 程  : 단위정 | 政  : 정사정 | 丁  : 고무래정 | 整  : 가지런할정 | 靜  : 고요할정 | 弟  : 아우제 | 第  : 차례제 | 題  : 제목제 | 祭  : 제사제 | 濟  : 건널제 | 製  : 지을제 | 際  : 사이제 | 制  : 마를제 | 提  : 끌제 | 除  : 덜제 | 帝  : 임금제 | 祖  : 조상조 | 朝  : 아침조 | 調  : 고를조 | 操  : 잡을조 | 助  : 도울조 | 鳥  : 새조 | 造  : 지을조 | 早  : 새벽조 | 條  : 가지조 | 組  : 끈조 | 潮  : 밀물조 | 足  : 발족 | 族  : 겨레족 | 尊  : 높을존 | 存  : 있을존 | 卒  : 군사졸 | 種  : 씨종 | 終  : 마칠종 | 宗  : 마루종 | 從  : 좇을종 | 鐘  : 종종 | 左  : 왼좌 | 座  : 자리좌 | 罪  : 허물죄 | 主  : 주인주 | 住  : 살주 | 注  : 부을주 | 晝  : 낮주 | 週  : 돌주 | 州  : 고을주 | 走  : 달릴주 | 周  : 두루주 | 朱  : 붉을주 | 酒  : 술주 | 竹  : 대죽 | 準  : 준할준 | 中  : 가운데중 | 重  : 무거울중 | 衆  : 무리중 | 增  : 붙을증 | 證  : 증거증 | 紙  : 종이지 | 地  : 땅지 | 知  : 알지 | 止  : 그칠지 | 至  : 이를지 | 志  : 뜻지 | 支  : 가를지 | 指  : 손가락지 | 誌  : 기록할지 | 持  : 가질지 | 智  : 슬기지 | 直  : 곧을직 | 職  : 벼슬직 | 織  : 짤직 | 進  : 나아갈진 | 眞  : 참진 | 盡  : 다할진 | 珍  : 보배진 | 陣  : 진칠진 | 質  : 바탕질 | 集  : 모일집 | 次  : 버금차 | 差  : 어긋날차 | 着  : 붙을착 | 讚  : 기릴찬 | 察  : 살필찰 | 參  : 간여할참 | 窓  : 창창 | 唱  : 노래창 | 創  : 비롯할창 | 採  : 캘채 | 責  : 꾸짖을책 | 冊  : 책책 | 處  : 살처 | 川  : 내천 | 千  : 일천천 | 天  : 하늘천 | 泉  : 샘천 | 鐵  : 쇠철 | 靑  : 푸를청 | 淸  : 맑을청 | 請  : 청할청 | 聽  : 들을청 | 廳  : 관청청 | 體  : 몸체 | 草  : 풀초 | 初  : 처음초 | 招  : 부를초 | 寸  : 마디촌 | 村  : 마을촌 | 銃  : 총총 | 總  : 거느릴총 | 最  : 가장최 | 秋  : 가을추 | 推  : 밀추 | 祝  : 빌축 | 築  : 쌓을축 | 蓄  : 모을축 | 縮  : 줄일축 | 春  : 봄춘 | 出  : 날출 | 充  : 찰충 | 蟲  : 벌레충 | 忠  : 충성충 | 取  : 취할취 | 趣  : 뜻취 | 就  : 이룰취 | 測  : 헤아릴측 | 層  : 층층 | 致  : 이를치 | 置  : 둘치 | 齒  : 이치 | 治  : 다스릴치 | 則  : 법칙칙 | 親  : 친할친 | 七  : 일곱칠 | 侵  : 범할침 | 寢  : 잠잘침 | 針  : 바늘침 | 稱  : 일컬을칭 | 快  : 쾌할쾌 | 打  : 칠타 | 他  : 다를타 | 卓  : 높을탁 | 炭  : 숯탄 | 彈  : 탄알탄 | 歎  : 탄식할탄 | 脫  : 벚을탈 | 探  : 찾을탐 | 太  : 클태 | 態  : 모양태 | 宅  : 집택 | 擇  : 가릴택 | 土  : 흙토 | 討  : 칠토 | 通  : 통할통 | 統  : 거느릴통 | 痛  : 아플통 | 退  : 물러날퇴 | 鬪  : 싸움투 | 投  : 던질투 | 特  : 특별할특 | 波  : 물결파 | 破  : 깨뜨릴파 | 派  : 갈래파 | 板  : 널빤지판 | 判  : 판가름할판 | 八  : 여덟팔 | 敗  : 패할패 | 便  : 편할편 | 篇  : 책편 | 平  : 평평할평 | 評  : 평할평 | 閉  : 닫을폐 | 砲  : 대포포 | 包  : 쌀포 | 布  : 베포 | 胞  : 세포포 | 暴  : 사나울포 | 爆  : 터질폭 | 表  : 겉표 | 票  : 표표 | 標  : 표할표 | 品  : 물건품 | 風  : 바람풍 | 豊  : 풍년풍 | 疲  : 지칠피 | 避  : 피할피 | 必  : 반드시필 | 筆  : 붓필 | 下  : 아래하 | 夏  : 여름하 | 河  : 강하 | 學  : 배울학 | 韓  : 한나라한 | 漢  : 한수한 | 寒  : 찰한 | 限  : 한정할한 | 閑  : 한가할한 | 恨  : 원통할한 | 合  : 합할합 | 港  : 항구항 | 航  : 배항 | 抗  : 겨룰항 | 海  : 바다해 | 害  : 해칠해 | 解  : 풀해 | 核  : 씨핵 | 幸  : 다행행 | 行  : 갈행 | 向  : 향할향 | 香  : 향기향 | 鄕  : 시골향 | 許  : 허락할허 | 虛  : 빌허 | 憲  : 법헌 | 驗  : 시험험 | 險  : 험할험 | 革  : 가죽혁 | 現  : 나타날현 | 賢  : 어질현 | 顯  : 나타날현 | 血  : 피혈 | 協  : 화합할협 | 兄  : 형형 | 形  : 모양형 | 刑  : 형벌형 | 惠  : 은혜혜 | 號  : 부르짖을호 | 湖  : 호수호 | 呼  : 부를호 | 護  : 보호할호 | 好  : 좋을호 | 戶  : 지게호 | 或  : 혹(혹시)혹 | 混  : 섞을혼 | 婚  : 혼인할혼 | 紅  : 붉을홍 | 火  : 불화 | 話  : 말할화 | 花  : 꽃화 | 和  : 화할화 | 畵  : 그림화 | 化  : 될화 | 貨  : 재물화 | 華  : 빛날화 | 確  : 굳을확 | 患  : 근심환 | 環  : 고리환 | 歡  : 기뻐할환 | 活  : 살활 | 黃  : 누를황 | 況  : 상황황 | 會  : 모일회 | 回  : 돌회 | 灰  : 재(석회)회 | 孝  : 효도효 | 效  : 본받을효 | 後  : 뒤후 | 候  : 기후후 | 厚  : 두터울후 | 訓  : 가르칠훈 | 揮  : 휘두를휘 | 休  : 쉴휴 | 凶  : 흉할흉 | 黑  : 검을흑 | 吸  : 마실흡 | 興  : 일어날흥 | 希  : 바랄희 | 喜  : 기쁠희 |

*** 한자 3급
 #+BEGIN_SRC emacs-lisp
   (setf hanja-grade3
         (-difference
          '(
            "可  : 옳을가"
            "加  : 더할가"
            "佳  : 아름다울가"
            "架  : 시렁가"
            "家  : 집가"
            "假  : 거짓가"
            "街  : 거리가"
            "暇  : 틈가"
            "歌  : 노래가"
            "價  : 값가"
            "各  : 각각각"
            "角  : 뿔각"
            "却  : 물리칠각"
            "刻  : 새길각"
            "脚  : 다리각"
            "閣  : 집각"
            "覺  : 깨달을각"
            "干  : 방패간"
            "刊  : 새길간"
            "肝  : 간간"
            "看  : 볼간"
            "姦  : 간음할간"
            "間  : 사이간"
            "幹  : 줄기간"
            "懇  : 간절할간"
            "簡  : 대쪽간"
            "渴  : 목마를갈"
            "甘  : 달감"
            "減  : 덜감"
            "敢  : 감히감"
            "感  : 느낄감"
            "監  : 볼감"
            "鑑  : 거울감"
            "甲  : 갑옷갑"
            "江  : 강강"
            "降  : 내릴강"
            "剛  : 굳셀강"
            "康  : 편안강"
            "强  : 강할강"
            "綱  : 벼리강"
            "鋼  : 강철강"
            "講  : 욀강"
            "介  : 낄개"
            "改  : 고칠개"
            "皆  : 다개"
            "個  : 낱개"
            "開  : 열개"
            "蓋  : 덮을개"
            "慨  : 슬퍼할개"
            "槪  : 대개개"
            "客  : 손객"
            "去  : 갈거"
            "巨  : 클거"
            "車  : 수레거/차"
            "居  : 살거"
            "拒  : 막을거"
            "距  : 떨어질거"
            "據  : 근거거"
            "擧  : 들거"
            "件  : 물건건"
            "建  : 세울건"
            "健  : 굳셀건"
            "乾  : 하늘건"
            "乞  : 빌걸"
            "傑  : 뛰어날걸"
            "儉  : 검소할검"
            "劍  : 칼검"
            "檢  : 검사할검"
            "格  : 격식격"
            "隔  : 사이뜰격"
            "激  : 격할격"
            "擊  : 칠격"
            "犬  : 개견"
            "見  : 볼견"
            "肩  : 어깨견"
            "牽  : 이끌견"
            "堅  : 굳을견"
            "遣  : 보낼견"
            "絹  : 비단견"
            "決  : 결단할결"
            "缺  : 이지러질결"
            "結  : 맺을결"
            "潔  : 깨끗할결"
            "訣  : 이별할결"
            "兼  : 겸할겸"
            "謙  : 겸손할겸"
            "京  : 서울경"
            "庚  : 별경"
            "徑  : 지름길경"
            "耕  : 밭갈경"
            "竟  : 마침내경"
            "頃  : 이랑경"
            "景  : 볕경"
            "卿  : 벼슬경"
            "硬  : 굳을경"
            "敬  : 공경경"
            "傾  : 기울경"
            "經  : 지날경"
            "境  : 지경경"
            "輕  : 가벼울경"
            "慶  : 경사경"
            "警  : 깨우칠경"
            "更  : 고칠경"
            "鏡  : 거울경"
            "競  : 다툴경"
            "驚  : 놀랄경"
            "系  : 이어맬계"
            "戒  : 경계할계"
            "季  : 계절계"
            "界  : 지경계"
            "癸  : 열째천간계"
            "契  : 맺을계"
            "係  : 맬계"
            "計  : 셀계"
            "桂  : 계수나무계"
            "啓  : 열계"
            "械  : 기계계"
            "階  : 섬돌계"
            "溪  : 시내계"
            "繫  : 맬계"
            "繼  : 이을계"
            "鷄  : 닭계"
            "古  : 예고"
            "考  : 생각할고"
            "告  : 고할고"
            "固  : 굳을고"
            "苦  : 쓸고"
            "姑  : 시어미고"
            "孤  : 외로울고"
            "枯  : 마를고"
            "故  : 연고고"
            "高  : 높을고"
            "庫  : 곳집고"
            "鼓  : 북고"
            "稿  : 원고고"
            "顧  : 돌아볼고"
            "曲  : 굽을곡"
            "谷  : 골곡"
            "哭  : 울곡"
            "穀  : 곡식곡"
            "困  : 곤할곤"
            "坤  : 땅곤"
            "骨  : 뼈골"
            "工  : 장인공"
            "公  : 공평할공"
            "孔  : 구멍공"
            "功  : 공공"
            "共  : 한가지공"
            "攻  : 칠공"
            "空  : 빌공"
            "供  : 이바지할공"
            "恭  : 공손할공"
            "貢  : 바칠공"
            "恐  : 두려울공"
            "果  : 실과과"
            "科  : 과목과"
            "過  : 지날과"
            "誇  : 자랑할과"
            "寡  : 적을과"
            "課  : 과할과"
            "郭  : 둘레곽"
            "官  : 벼슬관"
            "冠  : 갓관"
            "貫  : 꿸관"
            "寬  : 너그러울관"
            "管  : 대롱관"
            "慣  : 익숙할관"
            "館  : 집관"
            "關  : 관계할관"
            "觀  : 볼관"
            "光  : 빛광"
            "狂  : 미칠광"
            "廣  : 넓을광"
            "鑛  : 쇳돌광"
            "掛  : 걸괘"
            "怪  : 기이할괴"
            "塊  : 흙덩이괴"
            "愧  : 부끄러울괴"
            "壞  : 무너질괴"
            "巧  : 공교할교"
            "交  : 사귈교"
            "郊  : 들교"
            "校  : 학교교"
            "敎  : 가르칠교"
            "較  : 견줄교"
            "橋  : 다리교"
            "矯  : 바로잡을교"
            "九  : 아홉구"
            "口  : 입구"
            "久  : 오랠구"
            "丘  : 언덕구"
            "句  : 글귀구"
            "求  : 구할구"
            "究  : 연구할구"
            "具  : 갖출구"
            "苟  : 구차할구"
            "拘  : 잡을구"
            "狗  : 개구"
            "俱  : 함께구"
            "區  : 구분할구"
            "球  : 공구"
            "救  : 구원할구"
            "構  : 얽을구"
            "舊  : 예구"
            "懼  : 두려워할구"
            "驅  : 몰구"
            "龜  : 땅이름구"
            "局  : 판국"
            "菊  : 국화국"
            "國  : 나라국"
            "君  : 임군군"
            "軍  : 군사군"
            "郡  : 고을군"
            "群  : 무리군"
            "屈  : 굽힐굴"
            "弓  : 활궁"
            "宮  : 집궁"
            "窮  : 다할궁"
            "券  : 문서권"
            "卷  : 책권"
            "拳  : 주먹권"
            "勸  : 권할권"
            "權  : 권세권"
            "厥  : 그궐"
            "軌  : 바큇자국궤"
            "鬼  : 귀신귀"
            "貴  : 귀할귀"
            "歸  : 돌아갈귀"
            "叫  : 부르짖을규"
            "糾  : 얽힐규"
            "規  : 법규"
            "均  : 고를균"
            "菌  : 버섯균"
            "克  : 이길극"
            "極  : 극진할극"
            "劇  : 심할극"
            "斤  : 근근"
            "近  : 가까울근"
            "根  : 뿌리근"
            "筋  : 힘줄근"
            "僅  : 겨우근"
            "勤  : 부지런할근"
            "謹  : 삼갈근"
            "今  : 이제금"
            "金  : 쇠금"
            "禽  : 새금"
            "琴  : 거문고금"
            "禁  : 금할금"
            "錦  : 비단금"
            "及  : 미칠급"
            "急  : 급할급"
            "級  : 등급급"
            "給  : 줄급"
            "肯  : 즐길긍"
            "己  : 몸기"
            "企  : 꾀할기"
            "忌  : 꺼릴기"
            "技  : 재주기"
            "汽  : 물긇는김기"
            "奇  : 기특할기"
            "其  : 그기"
            "祈  : 빌기"
            "紀  : 벼리기"
            "氣  : 기운기"
            "豈  : 어찌기"
            "起  : 일어날기"
            "記  : 기록할기"
            "飢  : 주릴기"
            "基  : 터기"
            "寄  : 부칠기"
            "旣  : 이미기"
            "棄  : 버릴기"
            "幾  : 몇기"
            "欺  : 속일기"
            "期  : 기약할기"
            "旗  : 기기"
            "畿  : 경기기"
            "器  : 그릇기"
            "機  : 틀기"
            "騎  : 말탈기"
            "緊  : 긴할긴"
            "吉  : 길할길"
            "那  : 어찌나"
            "諾  : 허락할낙"
            "暖  : 따뜻할난"
            "難  : 어려울난"
            "男  : 사내남"
            "南  : 남녘남"
            "納  : 들일납"
            "娘  : 계집낭"
            "乃  : 이에내"
            "內  : 안내"
            "奈  : 어찌내"
            "耐  : 견딜내"
            "女  : 계집녀"
            "年  : 해년"
            "念  : 생각념"
            "寧  : 편안녕"
            "奴  : 종노"
            "努  : 힘쓸노"
            "怒  : 성낼노"
            "農  : 농사농"
            "濃  : 짙을농"
            "惱  : 번뇌할뇌"
            "腦  : 골뇌"
            "能  : 능할능"
            "泥  : 진흙니"
            "多  : 많을다"
            "茶  : 차다/차"
            "丹  : 붉을단"
            "旦  : 아침단"
            "但  : 다만단"
            "段  : 층계단"
            "單  : 홑단"
            "短  : 짧을단"
            "團  : 둥글단"
            "端  : 끝단"
            "壇  : 단단"
            "檀  : 박달나무단"
            "斷  : 끊을단"
            "達  : 통달할달"
            "淡  : 맑을담"
            "談  : 말씀담"
            "擔  : 멜담"
            "畓  : 논답"
            "答  : 대답할답"
            "踏  : 밟을답"
            "唐  : 당나라당"
            "堂  : 집당"
            "當  : 마땅당"
            "糖  : 엿당"
            "黨  : 무리당"
            "大  : 큰대"
            "代  : 대신할대"
            "待  : 기다릴대"
            "帶  : 띠대"
            "貸  : 빌릴대"
            "隊  : 무리대"
            "臺  : 대대"
            "對  : 대할대"
            "德  : 큰덕"
            "刀  : 칼도"
            "到  : 이를도"
            "度  : 법도도"
            "挑  : 돋울도"
            "逃  : 도망도"
            "島  : 섬도"
            "倒  : 넘어질도"
            "徒  : 무리도"
            "途  : 길도"
            "桃  : 복숭아도"
            "陶  : 질그릇도"
            "盜  : 도둑도"
            "渡  : 건널도"
            "道  : 길도"
            "都  : 도읍도"
            "塗  : 칠할도"
            "跳  : 뛸도"
            "圖  : 그림도"
            "稻  : 벼도"
            "導  : 인도할도"
            "毒  : 독독"
            "督  : 감독할독"
            "篤  : 도타울독"
            "獨  : 홀로독"
            "讀  : 읽을독"
            "豚  : 돼지돈"
            "敦  : 도타울돈"
            "突  : 갑자기돌"
            "冬  : 겨울동"
            "同  : 한가지동"
            "東  : 동녘동"
            "洞  : 골동"
            "凍  : 얼동"
            "動  : 움직일동"
            "童  : 아이동"
            "銅  : 구리동"
            "斗  : 말두"
            "豆  : 콩두"
            "頭  : 머리두"
            "屯  : 진칠둔"
            "鈍  : 둔할둔"
            "得  : 얻을득"
            "登  : 오를등"
            "等  : 무리등"
            "燈  : 등등"
            "騰  : 오를등"
            "羅  : 벌일라"
            "落  : 떨어질락"
            "絡  : 이을락"
            "樂  : 즐거울락"
            "卵  : 알란"
            "亂  : 어지러울란"
            "蘭  : 난초란"
            "欄  : 난간란"
            "濫  : 넘칠람"
            "覽  : 볼람"
            "浪  : 물결랑"
            "郞  : 사내랑"
            "朗  : 밝을랑"
            "廊  : 사랑채랑"
            "來  : 올래"
            "冷  : 찰랭"
            "略  : 간략할략"
            "掠  : 노략질할략"
            "良  : 어질량"
            "兩  : 두량"
            "凉  : 서늘할량"
            "梁  : 들보량"
            "量  : 헤아릴량"
            "諒  : 살필량"
            "糧  : 양식량"
            "旅  : 나그네려"
            "慮  : 생각할려"
            "勵  : 힘쓸려"
            "麗  : 고울려"
            "力  : 힘력"
            "歷  : 지날력"
            "曆  : 책력력"
            "連  : 이을련"
            "蓮  : 연꽃련"
            "憐  : 불쌍히여길련"
            "練  : 익힐련"
            "聯  : 연이을련"
            "鍊  : 쇠불릴련"
            "戀  : 그리워할련"
            "劣  : 못할렬"
            "列  : 벌일렬"
            "烈  : 매울렬"
            "裂  : 찢어질렬"
            "廉  : 청렴할렴"
            "獵  : 사냥렵"
            "令  : 하여금령"
            "零  : 떨어질령"
            "領  : 거느릴령"
            "嶺  : 고개령"
            "靈  : 신령령"
            "例  : 법식례"
            "禮  : 예도례"
            "隷  : 종례"
            "老  : 늙을로"
            "勞  : 일할로"
            "路  : 길로"
            "露  : 이슬로"
            "爐  : 화로로"
            "鹿  : 사슴록"
            "祿  : 녹록"
            "綠  : 푸를록"
            "錄  : 기록할록"
            "論  : 논할론"
            "弄  : 희롱할롱"
            "雷  : 우레뢰"
            "賴  : 의지할뢰"
            "了  : 마칠료"
            "料  : 헤아릴료"
            "僚  : 동료료"
            "龍  : 용룡"
            "累  : 여러루"
            "淚  : 눈물루"
            "屢  : 여러루"
            "漏  : 샐루"
            "樓  : 다락루"
            "柳  : 버들류"
            "留  : 머무를류"
            "流  : 흐를류"
            "類  : 무리류"
            "六  : 여섯륙"
            "陸  : 뭍륙"
            "倫  : 인륜륜"
            "輪  : 바퀴륜"
            "律  : 법칙률"
            "栗  : 밤률"
            "率  : 비율률"
            "隆  : 높을륭"
            "陵  : 언덕릉"
            "里  : 마을리"
            "理  : 다스릴리"
            "利  : 이로울리"
            "離  : 떠날리"
            "裏  : 속리"
            "梨  : 배리"
            "履  : 밟을리"
            "李  : 오얏리"
            "吏  : 관리리"
            "隣  : 이웃린"
            "林  : 수풀림"
            "臨  : 임할림"
            "立  : 설립"
            "馬  : 말마"
            "麻  : 삼마"
            "磨  : 갈마"
            "莫  : 없을막"
            "幕  : 장막막"
            "漠  : 넓을막"
            "萬  : 일만만"
            "晩  : 늦을만"
            "滿  : 찰만"
            "慢  : 거만할만"
            "漫  : 흩어질만"
            "末  : 끝말"
            "亡  : 망할망"
            "妄  : 망령될망"
            "忙  : 바쁠망"
            "忘  : 잊을망"
            "罔  : 없을망"
            "茫  : 아득할망"
            "望  : 바랄망"
            "每  : 매양매"
            "妹  : 누이매"
            "埋  : 묻을매"
            "買  : 살매"
            "梅  : 매화매"
            "媒  : 중매매"
            "賣  : 팔매"
            "脈  : 줄기맥"
            "麥  : 보리맥"
            "盲  : 소경맹"
            "孟  : 맏맹"
            "猛  : 사나울맹"
            "盟  : 맹세맹"
            "免  : 면할면"
            "面  : 낯면"
            "眠  : 잘면"
            "勉  : 힘쓸면"
            "綿  : 솜면"
            "滅  : 멸할멸"
            "名  : 이름명"
            "命  : 목숨명"
            "明  : 밝을명"
            "冥  : 어두울명"
            "鳴  : 울명"
            "銘  : 새길명"
            "毛  : 털모"
            "母  : 어미모"
            "某  : 아무모"
            "侮  : 업신여길모"
            "募  : 모을모"
            "慕  : 그릴모"
            "暮  : 저물모"
            "模  : 본뜰모"
            "貌  : 모양모"
            "謀  : 꾀모"
            "冒  : 무릅쓸모"
            "木  : 나무목"
            "目  : 눈목"
            "牧  : 칠목"
            "睦  : 화목할목"
            "沒  : 빠질몰"
            "夢  : 꿈몽"
            "蒙  : 어두울몽"
            "卯  : 토끼묘"
            "妙  : 묘할묘"
            "苗  : 모묘"
            "墓  : 무덤묘"
            "廟  : 사당묘"
            "戊  : 천간무"
            "茂  : 무성할무"
            "武  : 호반무"
            "務  : 힘쓸무"
            "無  : 없을무"
            "貿  : 무역할무"
            "舞  : 춤출무"
            "霧  : 안개무"
            "墨  : 먹묵"
            "黙  : 잠잠할묵"
            "文  : 글월문"
            "門  : 문문"
            "問  : 물을문"
            "聞  : 들을문"
            "紋  : 무늬문"
            "勿  : 말물"
            "物  : 물건물"
            "未  : 아닐미"
            "米  : 쌀미"
            "尾  : 꼬리미"
            "味  : 맛미"
            "美  : 아름다울미"
            "眉  : 눈썹미"
            "迷  : 미혹할미"
            "微  : 작을미"
            "民  : 백성민"
            "敏  : 민첩할민"
            "憫  : 민망할민"
            "密  : 빽빽할밀"
            "蜜  : 꿀밀"
            "朴  : 순박할박"
            "泊  : 머무를박"
            "拍  : 칠박"
            "迫  : 핍박할박"
            "博  : 넓을박"
            "薄  : 엷을박"
            "反  : 돌이킬반"
            "半  : 반반"
            "伴  : 짝반"
            "返  : 돌이킬반"
            "叛  : 배반할반"
            "班  : 나눌반"
            "般  : 일반반"
            "飯  : 밥반"
            "盤  : 소반반"
            "拔  : 뽑을발"
            "發  : 필발"
            "髮  : 터럭발"
            "方  : 모방"
            "芳  : 꽃다울방"
            "妨  : 방해할방"
            "防  : 막을방"
            "邦  : 나라방"
            "房  : 방방"
            "放  : 놓을방"
            "倣  : 본뜰방"
            "訪  : 찿을방"
            "傍  : 곁방"
            "杯  : 잔배"
            "拜  : 절배"
            "背  : 등배"
            "倍  : 곱배"
            "配  : 짝배"
            "培  : 복돋을배"
            "排  : 밀칠배"
            "輩  : 무리배"
            "白  : 흰백"
            "百  : 일백백"
            "伯  : 맏백"
            "番  : 차례번"
            "煩  : 번거로울번"
            "繁  : 번성할번"
            "飜  : 번역할번"
            "伐  : 칠벌"
            "罰  : 벌할벌"
            "凡  : 무릇범"
            "犯  : 범할범"
            "範  : 법범"
            "法  : 법법"
            "碧  : 푸를벽"
            "壁  : 벽벽"
            "辨  : 분별할변"
            "邊  : 가변"
            "辯  : 말씀변"
            "變  : 변할변"
            "別  : 다를별"
            "丙  : 남녘병"
            "兵  : 병사병"
            "屛  : 병풍병"
            "竝  : 나란히병"
            "病  : 병병"
            "步  : 걸음보"
            "保  : 지킬보"
            "普  : 넓을보"
            "補  : 기울보"
            "報  : 갚을보"
            "譜  : 족보보"
            "寶  : 보배보"
            "卜  : 점복"
            "伏  : 엎드릴복"
            "服  : 옷복"
            "復  : 회복할복"
            "腹  : 배복"
            "福  : 복복"
            "複  : 겹칠복"
            "覆  : 엎을복"
            "本  : 근본본"
            "奉  : 받들봉"
            "封  : 봉할봉"
            "峯  : 봉우리봉"
            "逢  : 만날봉"
            "蜂  : 벌봉"
            "鳳  : 새봉"
            "夫  : 지아비부"
            "父  : 아비부"
            "付  : 부칠부"
            "否  : 아닐부"
            "扶  : 도울부"
            "府  : 마을부"
            "附  : 붙을부"
            "負  : 질부"
            "赴  : 다다를부"
            "浮  : 뜰부"
            "符  : 부호부"
            "婦  : 며느리부"
            "部  : 떼부"
            "副  : 버금부"
            "富  : 부자부"
            "腐  : 썩을부"
            "賦  : 부세부"
            "簿  : 문서부"
            "北  : 북녘북"
            "分  : 나눌분"
            "奔  : 달릴분"
            "粉  : 가루분"
            "紛  : 어지러울분"
            "憤  : 분할분"
            "墳  : 무덤분"
            "奮  : 떨칠분"
            "不  : 아닐불/부"
            "佛  : 부처불"
            "拂  : 떨칠불"
            "朋  : 벗붕"
            "崩  : 무너질붕"
            "比  : 견줄비"
            "妃  : 왕비비"
            "批  : 비평할비"
            "非  : 아닐비"
            "肥  : 살찔비"
            "卑  : 낮을비"
            "飛  : 날비"
            "祕  : 숨길비"
            "悲  : 슬플비"
            "費  : 쓸비"
            "備  : 갖출비"
            "婢  : 계집종비"
            "鼻  : 코비"
            "碑  : 비석비"
            "貧  : 가난할빈"
            "賓  : 손빈"
            "頻  : 자주빈"
            "氷  : 얼음빙"
            "聘  : 부를빙"
            "士  : 선비사"
            "巳  : 뱀사"
            "四  : 넉사"
            "史  : 사기사"
            "司  : 맡을사"
            "仕  : 섬길사"
            "寺  : 절사"
            "死  : 죽을사"
            "似  : 닮을사"
            "沙  : 모래사"
            "邪  : 간사할사"
            "私  : 사사사"
            "舍  : 집사"
            "事  : 일사"
            "使  : 부릴사"
            "社  : 모일사"
            "祀  : 제사사"
            "査  : 조사할사"
            "思  : 생각사"
            "師  : 스승사"
            "射  : 쏠사"
            "捨  : 버릴사"
            "蛇  : 긴뱀사"
            "斜  : 비낄사"
            "絲  : 실사"
            "詐  : 속일사"
            "詞  : 말사"
            "斯  : 이사"
            "寫  : 베낄사"
            "賜  : 줄사"
            "謝  : 사례할사"
            "辭  : 말씀사"
            "削  : 깍을삭"
            "朔  : 초하루삭"
            "山  : 메산"
            "産  : 낳을산"
            "散  : 흩을산"
            "算  : 셀산"
            "殺  : 죽일살"
            "三  : 석삼"
            "森  : 수풀삼"
            "上  : 위상"
            "床  : 상상"
            "尙  : 오히려상"
            "狀  : 모양상"
            "相  : 서로상"
            "桑  : 뽕나무상"
            "商  : 장사상"
            "常  : 떳떳할상"
            "祥  : 상서상"
            "喪  : 잃을상"
            "象  : 코끼리상"
            "想  : 생각상"
            "傷  : 다칠상"
            "詳  : 자세할상"
            "裳  : 치마상"
            "嘗  : 맛볼상"
            "像  : 모양상"
            "賞  : 상줄상"
            "霜  : 서리상"
            "償  : 갚을상"
            "塞  : 변방새"
            "色  : 빛색"
            "索  : 찿을색"
            "生  : 날생"
            "西  : 서녘서"
            "序  : 차례서"
            "書  : 글서"
            "恕  : 용서할서"
            "徐  : 천천할서"
            "庶  :  여러서"
            "敍  : 펼서"
            "暑  : 더울서"
            "署  : 마을서"
            "誓  : 맹세할서"
            "緖  : 실마리서"
            "逝  : 갈서"
            "夕  : 저녁석"
            "石  : 돌석"
            "昔  : 예석"
            "析  : 쪼갤석"
            "席  : 자리석"
            "惜  : 아낄석"
            "釋  : 풀석"
            "仙  : 신선선"
            "先  : 먼저선"
            "宣  : 베풀선"
            "旋  : 돌선"
            "船  : 배선"
            "善  : 착할선"
            "選  : 가릴선"
            "線  : 줄선"
            "禪  : 선선"
            "鮮  : 고울선"
            "舌  : 혀설"
            "雪  : 눈설"
            "設  : 베풀설"
            "說  : 말씀설"
            "涉  : 건널섭"
            "攝  : 다스릴섭"
            "成  : 이룰성"
            "性  : 성품성"
            "姓  : 성성"
            "省  : 살필성"
            "星  : 별성"
            "城  : 재성"
            "盛  : 성할성"
            "聖  : 성인성"
            "誠  : 정성성"
            "聲  : 소리성"
            "世  : 인간세"
            "洗  : 씻을세"
            "細  : 가늘세"
            "稅  : 세금세"
            "歲  : 해세"
            "勢  : 형세세"
            "小  : 작을소"
            "少  : 적을소"
            "召  : 부를소"
            "所  : 바소"
            "昭  : 밝을소"
            "素  : 본디소"
            "笑  : 웃음소"
            "消  : 사라질소"
            "掃  : 쓸소"
            "疏  : 소통할소"
            "訴  : 호소할소"
            "蔬  : 나물소"
            "燒  : 사를소"
            "蘇  : 되살아날소"
            "騷  : 떠들소"
            "束  : 묶을속"
            "俗  : 풍속속"
            "速  : 빠를속"
            "粟  : 조속"
            "屬  : 붙일속"
            "續  : 이을속"
            "孫  : 손자손"
            "損  : 덜손"
            "松  : 소나무송"
            "送  : 보낼송"
            "訟  : 송사할송"
            "頌  : 칭송할송"
            "誦  : 욀송"
            "刷  : 인쇄할쇄"
            "鎖  : 쇠사슬쇄"
            "衰  : 쇠할쇠"
            "水  : 물수"
            "手  : 손수"
            "囚  : 가둘수"
            "守  : 지킬수"
            "收  : 거둘수"
            "秀  : 빼어날수"
            "受  : 받을수"
            "垂  : 드리울수"
            "首  : 머리수"
            "帥  : 장수수"
            "修  : 닦을수"
            "殊  : 다를수"
            "授  : 줄수"
            "搜  : 찾을수"
            "須  : 모름지기수"
            "遂  : 드디어수"
            "愁  : 근심수"
            "睡  : 졸음수"
            "需  : 쓰일수"
            "壽  : 목숨수"
            "隨  : 따를수"
            "誰  : 누구수"
            "數  : 셀수"
            "樹  : 나무수"
            "輸  : 보낼수"
            "雖  : 비록수"
            "獸  : 짐승수"
            "叔  : 아재비숙"
            "宿  : 잘숙"
            "淑  : 맑을숙"
            "孰  : 누구숙"
            "肅  : 엄숙할숙"
            "熟  : 익을숙"
            "旬  : 열흘순"
            "巡  : 돌순"
            "殉  : 따라죽을순"
            "純  : 순수할순"
            "脣  : 입술순"
            "順  : 순할순"
            "循  : 돌순"
            "瞬  : 눈깜작일순"
            "戌  : 개술"
            "述  : 펼술"
            "術  : 재주술"
            "崇  : 높을숭"
            "拾  : 주을습,열십"
            "習  : 익힐습"
            "濕  : 젖을습"
            "襲  : 엄습할습"
            "承  : 이을승"
            "昇  : 오를승"
            "乘  : 탈승"
            "勝  : 이길승"
            "僧  : 중승"
            "市  : 저자시"
            "示  : 보일시"
            "矢  : 화살시"
            "侍  : 모실시"
            "始  : 비로소시"
            "是  : 이시"
            "施  : 베풀시"
            "時  : 때시"
            "視  : 볼시"
            "詩  : 시시"
            "試  : 시험시"
            "式  : 법식"
            "食  : 밥식"
            "息  : 쉴식"
            "植  : 심을식"
            "飾  : 꾸밀식"
            "識  : 알식"
            "申  : 납신"
            "臣  : 신하신"
            "辛  : 매울신"
            "身  : 몸신"
            "伸  : 펼신"
            "信  : 믿을신"
            "神  : 귀신신"
            "晨  : 새벽신"
            "愼  : 삼갈신"
            "新  : 새신"
            "失  : 잃을실"
            "室  : 집실"
            "實  : 열매실"
            "心  : 마음심"
            "甚  : 심할심"
            "深  : 깊을심"
            "尋  : 찾을심"
            "審  : 살필심"
            "十  : 열십"
            "雙  : 두쌍"
            "氏  : 각시씨"
            "牙  : 어금니아"
            "芽  : 싹아"
            "我  : 나아"
            "亞  : 버금아"
            "兒  : 아이아"
            "阿  : 언덕아"
            "雅  : 맑을아"
            "餓  : 주릴아"
            "岳  : 큰산악"
            "惡  : 악할악"
            "安  : 편안할안"
            "岸  : 언덕안"
            "案  : 책상안"
            "眼  : 눈안"
            "雁  : 기러기안"
            "顔  : 낯안"
            "謁  : 뵐알"
            "岩  : 바위암"
            "暗  : 어두울암"
            "押  : 누를압"
            "壓  : 누를압"
            "央  : 가운데앙"
            "仰  : 우러를앙"
            "殃  : 재앙앙"
            "哀  : 슬플애"
            "涯  : 물가애"
            "愛  : 사랑애"
            "厄  : 액액"
            "液  : 진액"
            "額  : 이마액"
            "也  : 이끼야"
            "夜  : 밤야"
            "耶  : 어조사야"
            "野  : 들야"
            "若  : 같을약"
            "約  : 맺을약"
            "弱  : 약할약"
            "藥  : 약약"
            "躍  : 뛸약"
            "羊  : 양양"
            "洋  : 큰바다양"
            "揚  : 날릴양"
            "陽  : 볕양"
            "楊  : 버들양"
            "養  : 기를양"
            "樣  : 모양양"
            "壤  : 흙덩이양"
            "讓  : 사양할양"
            "於  : 어조사어"
            "魚  : 물고기어"
            "御  : 거느릴어"
            "漁  : 고기잡을어"
            "語  : 말씀어"
            "抑  : 누를억"
            "億  : 억억"
            "憶  : 생각할억"
            "言  : 말씀언"
            "焉  : 어찌언"
            "嚴  : 엄할엄"
            "業  : 업업"
            "予  : 나여"
            "汝  : 너여"
            "如  : 같을여"
            "余  : 나여"
            "與  : 더불여"
            "餘  : 남을여"
            "輿  : 수레여"
            "亦  : 또역"
            "役  : 부릴역"
            "易  : 바꿀역"
            "逆  : 거스를역"
            "疫  : 전염병역"
            "域  : 지경역"
            "譯  : 번역할역"
            "驛  : 역역"
            "延  : 늘일연"
            "沿  : 물따라갈연"
            "宴  : 잔치연"
            "硏  : 갈연"
            "然  : 그럴연"
            "煙  : 연기연"
            "鉛  : 납연"
            "演  : 펼연"
            "緣  : 인연연"
            "燕  : 제비연"
            "悅  : 기쁠열"
            "閱  : 볼열"
            "熱  : 더울열"
            "炎  : 불꽃염"
            "染  : 물들염"
            "鹽  : 소금염"
            "葉  : 잎엽"
            "永  : 길영"
            "迎  : 맞을영"
            "英  : 꽃부리영"
            "泳  : 헤엄칠영"
            "映  : 비칠영"
            "詠  : 읊을영"
            "榮  : 영화영"
            "影  : 그림자영"
            "營  : 경영할영"
            "銳  : 날카로울예"
            "豫  : 미리예"
            "藝  : 재주예"
            "譽  : 기릴예"
            "午  : 낮오"
            "五  : 다섯오"
            "汚  : 더러울오"
            "吾  : 나오"
            "烏  : 까마귀오"
            "悟  : 깨달을오"
            "娛  : 즐길오"
            "嗚  : 슬플오"
            "傲  : 거만할오"
            "誤  : 그르칠오"
            "玉  : 구슬옥"
            "屋  : 집옥"
            "獄  : 옥옥"
            "溫  : 따뜻할온"
            "翁  : 늙은이옹"
            "擁  : 낄옹"
            "瓦  : 기와와"
            "臥  : 누울와"
            "完  : 완전할완"
            "緩  : 느릴완"
            "曰  : 가로왈"
            "王  : 임금왕"
            "往  : 갈왕"
            "外  : 바깥외"
            "畏  : 두려워할외"
            "要  : 요긴할요"
            "搖  : 흔들요"
            "遙  : 멀요"
            "腰  : 허리요"
            "謠  : 노래요"
            "曜  : 빛날요"
            "辱  : 욕될욕"
            "浴  : 목욕할욕"
            "欲  : 하고자할욕"
            "慾  : 욕심욕"
            "用  : 쓸용"
            "勇  : 날랠용"
            "容  : 얼굴용"
            "庸  : 떳떳할용"
            "又  : 또우"
            "于  : 어조사우"
            "友  : 벚우"
            "尤  : 더욱우"
            "牛  : 소우"
            "右  : 오른쪽우"
            "宇  : 집우"
            "羽  : 깃우"
            "雨  : 비우"
            "偶  : 짝우"
            "遇  : 만날우"
            "愚  : 어리석을우"
            "郵  : 우편우"
            "憂  : 근심우"
            "優  : 넉넉할우"
            "云  : 이를운"
            "雲  : 구름운"
            "運  : 옮길운"
            "韻  : 운운"
            "雄  : 수컷웅"
            "元  : 으뜸원"
            "怨  : 원망할원"
            "原  : 언덕원"
            "員  : 인원원"
            "院  : 집원"
            "援  : 도울원"
            "圓  : 둥글원"
            "園  : 동산원"
            "源  : 근원원"
            "遠  : 멀원"
            "願  : 원할원"
            "月  : 달월"
            "越  : 넘을월"
            "危  : 위태할위"
            "位  : 자리위"
            "委  : 맡길위"
            "胃  : 밥통위"
            "威  : 위엄위"
            "偉  : 클위"
            "爲  : 할위"
            "圍  : 에워쌀위"
            "違  : 어긋날위"
            "僞  : 거짓위"
            "慰  : 위로할위"
            "緯  : 씨위"
            "謂  : 이를위"
            "衛  : 지킬위"
            "由  : 말미암을유"
            "幼  : 어릴유"
            "有  : 있을유"
            "酉  : 닭유"
            "乳  : 젖유"
            "油  : 기름유"
            "柔  : 부드러울유"
            "幽  : 그윽할유"
            "唯  : 오직유"
            "惟  : 생각할유"
            "猶  : 오히려유"
            "裕  : 넉넉할유"
            "遊  : 놀유"
            "愈  : 나을유"
            "維  : 벼리유"
            "誘  : 꾈유"
            "遺  : 남길유"
            "儒  : 선비유"
            "肉  : 고기육"
            "育  : 기를육"
            "閏  : 윤달윤"
            "潤  : 불을윤"
            "恩  : 은혜은"
            "銀  : 은은"
            "隱  : 숨을은"
            "乙  : 새을"
            "吟  : 읊을음"
            "音  : 소리음"
            "淫  : 음란할음"
            "陰  : 그늘음"
            "飮  : 마실음"
            "邑  : 고을읍"
            "泣  : 울읍"
            "凝  : 엉길응"
            "應  : 응할응"
            "衣  : 옷의"
            "矣  : 어조사의"
            "宜  : 마땅의"
            "依  : 의지할의"
            "意  : 뜻의"
            "義  : 옳을의"
            "疑  : 의심할의"
            "儀  : 거동의"
            "醫  : 의원의"
            "議  : 의논할의"
            "二  : 두이"
            "已  : 이미이"
            "以  : 써이"
            "而  : 말이을이"
            "耳  : 귀이"
            "夷  : 오랑캐이"
            "異  : 다를이"
            "移  : 옮길이"
            "益  : 더할익"
            "翼  : 날개익"
            "人  : 사람인"
            "仁  : 어질인"
            "引  : 끌인"
            "因  : 인할인"
            "印  : 도장인"
            "忍  : 참을인"
            "姻  : 혼인인"
            "寅  : 범인"
            "認  : 알인"
            "一  : 한일"
            "日  : 날일"
            "逸  : 편안할일"
            "壬  : 북방임"
            "任  : 맡길임"
            "賃  : 품삯임"
            "入  : 들입"
            "子  : 아들자"
            "字  : 글자자"
            "自  : 스스로자"
            "姉  : 손위누이자"
            "刺  : 찌를자/척"
            "者  : 놈자"
            "玆  : 이자"
            "姿  : 모양자"
            "恣  : 방자할자"
            "紫  : 자주빛자"
            "慈  : 사랑자"
            "資  : 재물자"
            "作  : 지을작"
            "昨  : 어제작"
            "酌  : 술부을작"
            "爵  : 벼슬작"
            "殘  : 남을잔"
            "暫  : 잠깐잠"
            "潛  : 잠길잠"
            "雜  : 섞일잡"
            "丈  : 어른장"
            "壯  : 장할장"
            "長  : 길장"
            "莊  : 씩씩할장"
            "章  : 글장"
            "帳  : 장막장"
            "張  : 베풀장"
            "將  : 장수장"
            "掌  : 손바닥장"
            "葬  : 장사지낼장"
            "場  : 마당장"
            "粧  : 단장할장"
            "裝  : 꾸밀장"
            "腸  : 창자장"
            "獎  : 장려할장"
            "障  : 막을장"
            "藏  : 감출장"
            "臟  : 오장장"
            "墻  : 담장"
            "才  : 재주재"
            "在  : 있을재"
            "再  : 두재"
            "災  : 재앙재"
            "材  : 재목재"
            "哉  : 어조사재"
            "宰  : 재상재"
            "栽  : 심을재"
            "財  : 재물재"
            "裁  : 옷마를재"
            "載  : 실을재"
            "爭  : 다툴쟁"
            "低  : 낮을저"
            "底  : 밑저"
            "抵  : 막을저"
            "著  : 나타날저"
            "貯  : 쌓을저"
            "赤  : 붉을적"
            "的  : 과녁적"
            "寂  : 고요할적"
            "笛  : 피리적"
            "跡  : 발자취적"
            "賊  : 도둑적"
            "滴  : 물방울적"
            "摘  : 딸적"
            "適  : 맞을적"
            "敵  : 대적할적"
            "積  : 쌓을적"
            "績  : 길쌈적"
            "蹟  : 자취적"
            "籍  : 문서적"
            "田  : 밭전"
            "全  : 온전할전"
            "典  : 법전"
            "前  : 앞전"
            "展  : 펼전"
            "專  : 오로지전"
            "電  : 번개전"
            "傳  : 전할전"
            "殿  : 전각전"
            "錢  : 돈전"
            "戰  : 싸움전"
            "轉  : 구를전"
            "切  : 끊을절"
            "折  : 꺾을절"
            "竊  : 훔칠절"
            "絶  : 끊을절"
            "節  : 마디절"
            "占  : 점령할점"
            "店  : 가게점"
            "漸  : 점점점"
            "點  : 점점"
            "接  : 이을접"
            "蝶  : 나비접"
            "丁  : 장정정"
            "井  : 우물정"
            "正  : 바를정"
            "廷  : 조정정"
            "定  : 정할정"
            "征  : 칠정"
            "亭  : 정자정"
            "貞  : 곧을정"
            "政  : 정사정"
            "訂  : 바로잡을정"
            "庭  : 뜰정"
            "頂  : 정수리정"
            "停  : 머무를정"
            "情  : 뜻정"
            "淨  : 깨끗할정"
            "程  : 한도정"
            "精  : 정할정"
            "整  : 가지런할정"
            "靜  : 고요할정"
            "弟  : 아우제"
            "制  : 절제할제"
            "帝  : 임금제"
            "除  : 덜제"
            "第  : 차례제"
            "祭  : 제사제"
            "堤  : 둑제"
            "提  : 끌제"
            "齊  : 가지런할제"
            "製  : 지을제"
            "際  : 즈음제"
            "諸  : 모두제"
            "濟  : 건널제"
            "題  : 제목제"
            "弔  : 조상할조"
            "早  : 이를조"
            "兆  : 억조조"
            "助  : 도울조"
            "造  : 지을조"
            "祖  : 할아비조"
            "租  : 조세조"
            "鳥  : 새조"
            "條  : 가지조"
            "組  : 짤조"
            "朝  : 아침조"
            "照  : 비칠조"
            "潮  : 조수조"
            "調  : 고를조"
            "操  : 잡을조"
            "燥  : 마를조"
            "足  : 발족"
            "族  : 겨레족"
            "存  : 있을존"
            "尊  : 높을존"
            "卒  : 마칠졸"
            "拙  : 졸할졸"
            "宗  : 마루종"
            "從  : 좇을종"
            "終  : 마칠종"
            "種  : 씨종"
            "縱  : 세로종"
            "鍾  : 쇠북종"
            "左  : 왼좌"
            "坐  : 앉을좌"
            "佐  : 도울좌"
            "座  : 자리좌"
            "罪  : 허물죄"
            "主  : 주인주"
            "朱  : 붉을주"
            "舟  : 배주"
            "州  : 고을주"
            "走  : 달릴주"
            "住  : 살주"
            "周  : 두루주"
            "宙  : 집주"
            "注  : 부을주"
            "洲  : 물가주"
            "柱  : 기둥주"
            "奏  : 아뢸주"
            "酒  : 술주"
            "株  : 그루주"
            "珠  : 구슬주"
            "晝  : 낮주"
            "週  : 주일주"
            "鑄  : 쇠불릴주"
            "竹  : 대죽"
            "俊  : 준걸준"
            "準  : 준할준"
            "遵  : 좇을준"
            "中  : 가운데중"
            "仲  : 버금중"
            "重  : 무거울중"
            "衆  : 무리중"
            "卽  : 곧즉"
            "症  : 증세증"
            "曾  : 일찍증"
            "蒸  : 찔증"
            "增  : 더할증"
            "憎  : 미울증"
            "證  : 증거증"
            "贈  : 보낼증"
            "之  : 갈지"
            "止  : 그칠지"
            "支  : 지탱할지"
            "只  : 다만지"
            "至  : 이를지"
            "枝  : 가지지"
            "池  : 못지"
            "地  : 땅지"
            "志  : 뜻지"
            "知  : 알지"
            "持  : 가질지"
            "指  : 가리킬지"
            "紙  : 종이지"
            "智  : 지혜지"
            "誌  : 기록할지"
            "遲  : 더딜지"
            "直  : 곧을직"
            "職  : 직분직"
            "織  : 짤직"
            "辰  : 별진"
            "珍  : 보배진"
            "眞  : 참진"
            "振  : 떨칠진"
            "陣  : 진칠진"
            "陳  : 베풀진"
            "進  : 나아갈진"
            "盡  : 다할진"
            "震  : 우레진"
            "鎭  : 진압할진"
            "姪  : 조카질"
            "疾  : 병질"
            "秩  : 차례질"
            "質  : 바탕질"
            "執  : 잡을집"
            "集  : 모일집"
            "徵  : 부를징"
            "懲  : 징계할징"
            "且  : 또차"
            "次  : 버금차"
            "此  : 이차"
            "差  : 다를차"
            "借  : 빌릴차"
            "捉  : 잡을착"
            "着  : 붙을착"
            "錯  : 어긋날착"
            "贊  : 도울찬"
            "讚  : 기릴찬"
            "察  : 살필찰"
            "參  : 참여할참"
            "慘  : 참혹할참"
            "慙  : 부끄러울참"
            "昌  : 창성할창"
            "倉  : 곳집창"
            "窓  : 창창"
            "唱  : 부를창"
            "創  : 비롯할창"
            "蒼  : 푸를창"
            "暢  : 화창할창"
            "菜  : 나물채"
            "採  : 캘채"
            "彩  : 채색채"
            "債  : 빚채"
            "冊  : 책책"
            "責  : 꾸짖을책"
            "策  : 꾀책"
            "妻  : 아내처"
            "處  : 곳처"
            "尺  : 자척"
            "斥  : 물리칠척"
            "拓  : 넓힐척"
            "戚  : 친척척"
            "千  : 일천천"
            "川  : 내천"
            "天  : 하늘천"
            "泉  : 샘천"
            "淺  : 얕을천"
            "踐  : 밟을천"
            "賤  : 천할천"
            "遷  : 옮길천"
            "薦  : 천거할천"
            "哲  : 밝을철"
            "徹  : 통할철"
            "鐵  : 쇠철"
            "尖  : 뽀족할첨"
            "添  : 더할첨"
            "妾  : 첩첩"
            "靑  : 푸를청"
            "淸  : 맑을청"
            "晴  : 갤청"
            "請  : 청할청"
            "聽  : 들을청"
            "廳  : 관청청"
            "逮  : 잡을체"
            "替  : 바꿀체"
            "遞  : 갈릴체"
            "滯  : 막힐체"
            "體  : 몸체"
            "肖  : 닮을초"
            "抄  : 뽑을초"
            "初  : 처음초"
            "招  : 부를초"
            "草  : 풀초"
            "秒  : 분노초"
            "超  : 뛰어넘을초"
            "礎  : 주춧돌초"
            "促  : 재촉할촉"
            "燭  : 촛불촉"
            "觸  : 닿을촉"
            "寸  : 마디촌"
            "村  : 마을촌"
            "銃  : 총총"
            "聰  : 귀밝을총"
            "總  : 다총"
            "最  : 가장최"
            "催  : 재촉할최"
            "抽  : 뽑을추"
            "秋  : 가을추"
            "追  : 쫓을추"
            "推  : 밀추"
            "醜  : 추할추"
            "丑  : 소축"
            "畜  : 짐승축"
            "祝  : 빌축"
            "逐  : 쫓을축"
            "蓄  : 모을축"
            "築  : 쌓을축"
            "縮  : 줄일축"
            "春  : 봄춘"
            "出  : 날출"
            "充  : 채울충"
            "忠  : 충성충"
            "衝  : 찌를충"
            "蟲  : 벌레충"
            "吹  : 불취"
            "取  : 가질취"
            "就  : 나아갈취"
            "醉  : 취할취"
            "趣  : 뜻취"
            "側  : 곁측"
            "測  : 헤아릴측"
            "層  : 층층"
            "治  : 다스릴치"
            "値  : 값치"
            "恥  : 부끄러울치"
            "致  : 이를치"
            "置  : 둘치"
            "稚  : 어릴치"
            "齒  : 이치"
            "則  : 법칙"
            "親  : 친할친"
            "七  : 일곱칠"
            "漆  : 옻칠"
            "沈  : 잠길침"
            "枕  : 베개침"
            "侵  : 침노할침"
            "浸  : 잠길침"
            "針  : 바늘침"
            "寢  : 잘침"
            "稱  : 일컬을칭"
            "快  : 쾌할쾌"
            "他  : 다를타"
            "打  : 칠타"
            "妥  : 온당할타"
            "墮  : 떨어질타"
            "托  : 맡길탁"
            "卓  : 높을탁"
            "濁  : 흐릴탁"
            "濯  : 씻을탁"
            "炭  : 숯탄"
            "誕  : 낳을탄"
            "彈  : 탄알탄"
            "歎  : 탄식할탄"
            "脫  : 벚을탈"
            "奪  : 빼앗을탈"
            "貪  : 탐낼탐"
            "探  : 찾을탐"
            "塔  : 탑탑"
            "湯  : 끓일탕"
            "太  : 클태"
            "怠  : 게으를태"
            "殆  : 거의태"
            "泰  : 클태"
            "態  : 모습태"
            "宅  : 집택/댁"
            "澤  : 못택"
            "擇  : 가릴택"
            "土  : 흙토"
            "吐  : 토할토"
            "兎  : 토끼토"
            "討  : 칠토"
            "通  : 통할통"
            "痛  : 아플통"
            "統  : 거느릴통"
            "退  : 물러날퇴"
            "投  : 던질투"
            "透  : 사무칠투"
            "鬪  : 싸움투"
            "特  : 특별할특"
            "波  : 물결파"
            "派  : 갈래파"
            "破  : 깨뜨릴파"
            "頗  : 자못파"
            "罷  : 마칠파"
            "播  : 뿌릴파"
            "把  : 잡을파"
            "判  : 판단할판"
            "板  : 널판"
            "版  : 판목판"
            "販  : 팔판"
            "八  : 여덟팔"
            "貝  : 조개패"
            "敗  : 패할패"
            "片  : 조각편"
            "便  : 편할편"
            "偏  : 치우칠편"
            "遍  : 두루편"
            "篇  : 책편"
            "編  : 엮을편"
            "平  : 평평할평"
            "評  : 평할평"
            "肺  : 허파폐"
            "閉  : 닫을폐"
            "廢  : 폐할폐"
            "蔽  : 덮을폐"
            "弊  : 폐단폐"
            "幣  : 화폐폐"
            "布  : 베포"
            "包  : 쌀포"
            "抱  : 안을포"
            "怖  : 두려워할포"
            "胞  : 세포포"
            "浦  : 개포"
            "捕  : 잡을포"
            "砲  : 대포포"
            "飽  : 배부를포"
            "幅  : 폭폭"
            "暴  : 사나울폭"
            "爆  : 불터질폭"
            "表  : 겉표"
            "票  : 표표"
            "漂  : 떠다닐표"
            "標  : 표할표"
            "品  : 물건품"
            "風  : 바람풍"
            "楓  : 단풍풍"
            "豊  : 풍년풍"
            "皮  : 가죽피"
            "彼  : 저피"
            "疲  : 피곤할피"
            "被  : 입을피"
            "避  : 피할피"
            "匹  : 짝필"
            "必  : 반드시필"
            "畢  : 마칠필"
            "筆  : 붓필"
            "下  : 아래하"
            "何  : 어찌하"
            "河  : 물하"
            "夏  : 여름하"
            "荷  : 멜하"
            "賀  : 하례할하"
            "學  : 배울학"
            "鶴  : 학학"
            "汗  : 땀한"
            "旱  : 가물한"
            "恨  : 한한"
            "限  : 한할한"
            "寒  : 찰한"
            "閑  : 한가할한"
            "漢  : 한나라한"
            "韓  : 나라한"
            "割  : 벨할"
            "含  : 머금을함"
            "咸  : 다함"
            "陷  : 빠질함"
            "合  : 합할합"
            "抗  : 겨룰항"
            "巷  : 거리항"
            "恒  : 항상항"
            "航  : 배항"
            "港  : 항구항"
            "項  : 목항"
            "亥  : 돼지해"
            "害  : 해할해"
            "奚  : 어찌해"
            "海  : 바다해"
            "該  : 갖출해"
            "解  : 풀해"
            "核  : 씨핵"
            "行  : 다닐행"
            "幸  : 다행행"
            "向  : 향할향"
            "享  : 누릴향"
            "香  : 향기향"
            "鄕  : 시골향"
            "響  : 울릴향"
            "許  : 허락할허"
            "虛  : 빌허"
            "軒  : 집헌"
            "憲  : 법헌"
            "獻  : 드릴헌"
            "險  : 험할험"
            "驗  : 시험험"
            "革  : 가죽혁"
            "玄  : 검을현"
            "現  : 나타날현"
            "絃  : 줄현"
            "賢  : 어질현"
            "縣  : 고을현"
            "懸  : 달현"
            "顯  : 나타날현"
            "穴  : 굴혈"
            "血  : 피혈"
            "嫌  : 싫어할혐"
            "協  : 화할협"
            "脅  : 위협할협"
            "兄  : 형형"
            "刑  : 형벌형"
            "亨  : 형통할형"
            "形  : 모양형"
            "螢  : 반딧불형"
            "衡  : 저울대형"
            "兮  : 어조사혜"
            "惠  : 은혜혜"
            "慧  : 슬기로울혜"
            "戶  : 집호"
            "互  : 서로호"
            "乎  : 어조사호"
            "好  : 좋을호"
            "虎  : 범호"
            "呼  : 부를호"
            "胡  : 되호"
            "浩  : 넓을호"
            "毫  : 터럭호"
            "湖  : 호수호"
            "號  : 이름호"
            "豪  : 호걸호"
            "護  : 도울호"
            "或  : 혹혹"
            "惑  : 미혹할혹"
            "昏  : 어두울혼"
            "混  : 섞을혼"
            "婚  : 혼인할혼"
            "魂  : 넋혼"
            "忽  : 갑자기홀"
            "弘  : 클홍"
            "洪  : 넓을홍"
            "紅  : 붉을홍"
            "鴻  : 기러기홍"
            "火  : 불화"
            "化  : 될화"
            "禾  : 벼화"
            "花  : 꽃화"
            "和  : 화할화"
            "華  : 빛날화"
            "貨  : 재물화"
            "畵  : 그림화"
            "話  : 말씀화"
            "禍  : 재앙화"
            "確  : 굳을확"
            "擴  : 넓힐확"
            "穫  : 거둘확"
            "丸  : 둥글환"
            "患  : 근심환"
            "換  : 바꿀환"
            "還  : 돌아올환"
            "環  : 고리환"
            "歡  : 기쁠환"
            "活  : 살활"
            "況  : 상황황"
            "皇  : 임금황"
            "荒  : 거칠황"
            "黃  : 누를황"
            "回  : 돌아올회"
            "悔  : 뉘우칠회"
            "會  : 모일회"
            "懷  : 품을회"
            "劃  : 그을획"
            "獲  : 얻을획"
            "橫  : 가로횡"
            "孝  : 효도효"
            "效  : 본받을효"
            "曉  : 새벽효"
            "厚  : 두터울후"
            "侯  : 제후후"
            "後  : 뒤후"
            "候  : 기후후"
            "訓  : 가르칠훈"
            "毁  : 헐훼"
            "揮  : 휘두를휘"
            "輝  : 빛날휘"
            "休  : 쉴휴"
            "携  : 이끌휴"
            "烋  : 아름다울휴"
            "凶  : 흉할흉"
            "胸  : 가슴흉"
            "黑  : 검을흑"
            "吸  : 마실흡"
            "興  : 일흥"
            "希  : 바랄희"
            "喜  : 기쁠희"
            "稀  : 드물희"
            "戱  : 놀희"

            )
          hanja-grade4
          ))
 #+END_SRC

 #+RESULTS:
 | 佳  : 아름다울가 | 架  : 시렁가 | 却  : 물리칠각 | 脚  : 다리각 | 閣  : 집각 | 刊  : 새길간 | 肝  : 간간 | 姦  : 간음할간 | 幹  : 줄기간 | 懇  : 간절할간 | 渴  : 목마를갈 | 鑑  : 거울감 | 剛  : 굳셀강 | 康  : 편안강 | 綱  : 벼리강 | 鋼  : 강철강 | 講  : 욀강 | 介  : 낄개 | 皆  : 다개 | 蓋  : 덮을개 | 慨  : 슬퍼할개 | 槪  : 대개개 | 車  : 수레거/차 | 距  : 떨어질거 | 件  : 물건건 | 健  : 굳셀건 | 乾  : 하늘건 | 乞  : 빌걸 | 劍  : 칼검 | 隔  : 사이뜰격 | 肩  : 어깨견 | 牽  : 이끌견 | 遣  : 보낼견 | 絹  : 비단견 | 決  : 결단할결 | 訣  : 이별할결 | 兼  : 겸할겸 | 謙  : 겸손할겸 | 庚  : 별경 | 徑  : 지름길경 | 耕  : 밭갈경 | 竟  : 마침내경 | 頃  : 이랑경 | 卿  : 벼슬경 | 硬  : 굳을경 | 敬  : 공경경 | 警  : 깨우칠경 | 季  : 계절계 | 界  : 지경계 | 癸  : 열째천간계 | 契  : 맺을계 | 桂  : 계수나무계 | 啓  : 열계 | 械  : 기계계 | 溪  : 시내계 | 繫  : 맬계 | 古  : 예고 | 考  : 생각할고 | 告  : 고할고 | 姑  : 시어미고 | 枯  : 마를고 | 故  : 연고고 | 鼓  : 북고 | 稿  : 원고고 | 顧  : 돌아볼고 | 谷  : 골곡 | 哭  : 울곡 | 困  : 곤할곤 | 坤  : 땅곤 | 共  : 한가지공 | 供  : 이바지할공 | 恭  : 공손할공 | 貢  : 바칠공 | 恐  : 두려울공 | 果  : 실과과 | 科  : 과목과 | 誇  : 자랑할과 | 寡  : 적을과 | 課  : 과할과 | 郭  : 둘레곽 | 冠  : 갓관 | 貫  : 꿸관 | 寬  : 너그러울관 | 管  : 대롱관 | 慣  : 익숙할관 | 館  : 집관 | 關  : 관계할관 | 狂  : 미칠광 | 掛  : 걸괘 | 怪  : 기이할괴 | 塊  : 흙덩이괴 | 愧  : 부끄러울괴 | 壞  : 무너질괴 | 巧  : 공교할교 | 郊  : 들교 | 較  : 견줄교 | 矯  : 바로잡을교 | 久  : 오랠구 | 丘  : 언덕구 | 苟  : 구차할구 | 拘  : 잡을구 | 狗  : 개구 | 俱  : 함께구 | 區  : 구분할구 | 救  : 구원할구 | 懼  : 두려워할구 | 驅  : 몰구 | 龜  : 땅이름구 | 菊  : 국화국 | 屈  : 굽힐굴 | 弓  : 활궁 | 拳  : 주먹권 | 厥  : 그궐 | 軌  : 바큇자국궤 | 鬼  : 귀신귀 | 叫  : 부르짖을규 | 糾  : 얽힐규 | 菌  : 버섯균 | 克  : 이길극 | 極  : 극진할극 | 斤  : 근근 | 僅  : 겨우근 | 謹  : 삼갈근 | 禽  : 새금 | 琴  : 거문고금 | 錦  : 비단금 | 及  : 미칠급 | 給  : 줄급 | 肯  : 즐길긍 | 己  : 몸기 | 企  : 꾀할기 | 忌  : 꺼릴기 | 汽  : 물긇는김기 | 其  : 그기 | 祈  : 빌기 | 豈  : 어찌기 | 飢  : 주릴기 | 旣  : 이미기 | 棄  : 버릴기 | 幾  : 몇기 | 欺  : 속일기 | 旗  : 기기 | 畿  : 경기기 | 騎  : 말탈기 | 緊  : 긴할긴 | 那  : 어찌나 | 諾  : 허락할낙 | 納  : 들일납 | 娘  : 계집낭 | 乃  : 이에내 | 奈  : 어찌내 | 耐  : 견딜내 | 念  : 생각념 | 寧  : 편안녕 | 奴  : 종노 | 濃  : 짙을농 | 惱  : 번뇌할뇌 | 腦  : 골뇌 | 泥  : 진흙니 | 茶  : 차다/차 | 丹  : 붉을단 | 旦  : 아침단 | 但  : 다만단 | 淡  : 맑을담 | 畓  : 논답 | 踏  : 밟을답 | 唐  : 당나라당 | 糖  : 엿당 | 貸  : 빌릴대 | 臺  : 대대 | 對  : 대할대 | 德  : 큰덕 | 刀  : 칼도 | 度  : 법도도 | 挑  : 돋울도 | 逃  : 도망도 | 倒  : 넘어질도 | 途  : 길도 | 桃  : 복숭아도 | 陶  : 질그릇도 | 盜  : 도둑도 | 渡  : 건널도 | 塗  : 칠할도 | 跳  : 뛸도 | 稻  : 벼도 | 篤  : 도타울독 | 豚  : 돼지돈 | 敦  : 도타울돈 | 突  : 갑자기돌 | 洞  : 골동 | 凍  : 얼동 | 屯  : 진칠둔 | 鈍  : 둔할둔 | 燈  : 등등 | 騰  : 오를등 | 絡  : 이을락 | 蘭  : 난초란 | 欄  : 난간란 | 濫  : 넘칠람 | 浪  : 물결랑 | 郞  : 사내랑 | 廊  : 사랑채랑 | 略  : 간략할략 | 掠  : 노략질할략 | 凉  : 서늘할량 | 梁  : 들보량 | 諒  : 살필량 | 勵  : 힘쓸려 | 歷  : 지날력 | 曆  : 책력력 | 蓮  : 연꽃련 | 憐  : 불쌍히여길련 | 聯  : 연이을련 | 鍊  : 쇠불릴련 | 戀  : 그리워할련 | 劣  : 못할렬 | 裂  : 찢어질렬 | 廉  : 청렴할렴 | 獵  : 사냥렵 | 零  : 떨어질령 | 嶺  : 고개령 | 靈  : 신령령 | 禮  : 예도례 | 隷  : 종례 | 老  : 늙을로 | 露  : 이슬로 | 爐  : 화로로 | 鹿  : 사슴록 | 祿  : 녹록 | 論  : 논할론 | 弄  : 희롱할롱 | 雷  : 우레뢰 | 賴  : 의지할뢰 | 了  : 마칠료 | 僚  : 동료료 | 累  : 여러루 | 淚  : 눈물루 | 屢  : 여러루 | 漏  : 샐루 | 樓  : 다락루 | 倫  : 인륜륜 | 律  : 법칙률 | 栗  : 밤률 | 率  : 비율률 | 隆  : 높을륭 | 陵  : 언덕릉 | 裏  : 속리 | 梨  : 배리 | 履  : 밟을리 | 李  : 오얏리 | 吏  : 관리리 | 隣  : 이웃린 | 臨  : 임할림 | 麻  : 삼마 | 磨  : 갈마 | 莫  : 없을막 | 幕  : 장막막 | 漠  : 넓을막 | 晩  : 늦을만 | 慢  : 거만할만 | 漫  : 흩어질만 | 妄  : 망령될망 | 忙  : 바쁠망 | 忘  : 잊을망 | 罔  : 없을망 | 茫  : 아득할망 | 埋  : 묻을매 | 梅  : 매화매 | 媒  : 중매매 | 麥  : 보리맥 | 盲  : 소경맹 | 孟  : 맏맹 | 猛  : 사나울맹 | 盟  : 맹세맹 | 免  : 면할면 | 眠  : 잘면 | 綿  : 솜면 | 滅  : 멸할멸 | 冥  : 어두울명 | 銘  : 새길명 | 某  : 아무모 | 侮  : 업신여길모 | 募  : 모을모 | 慕  : 그릴모 | 暮  : 저물모 | 模  : 본뜰모 | 貌  : 모양모 | 謀  : 꾀모 | 冒  : 무릅쓸모 | 睦  : 화목할목 | 沒  : 빠질몰 | 夢  : 꿈몽 | 蒙  : 어두울몽 | 卯  : 토끼묘 | 苗  : 모묘 | 廟  : 사당묘 | 戊  : 천간무 | 茂  : 무성할무 | 武  : 호반무 | 貿  : 무역할무 | 霧  : 안개무 | 墨  : 먹묵 | 黙  : 잠잠할묵 | 紋  : 무늬문 | 勿  : 말물 | 尾  : 꼬리미 | 眉  : 눈썹미 | 迷  : 미혹할미 | 微  : 작을미 | 敏  : 민첩할민 | 憫  : 민망할민 | 蜜  : 꿀밀 | 朴  : 순박할박 | 泊  : 머무를박 | 迫  : 핍박할박 | 薄  : 엷을박 | 反  : 돌이킬반 | 伴  : 짝반 | 返  : 돌이킬반 | 叛  : 배반할반 | 般  : 일반반 | 飯  : 밥반 | 盤  : 소반반 | 拔  : 뽑을발 | 方  : 모방 | 芳  : 꽃다울방 | 邦  : 나라방 | 倣  : 본뜰방 | 訪  : 찿을방 | 傍  : 곁방 | 杯  : 잔배 | 配  : 짝배 | 培  : 복돋을배 | 排  : 밀칠배 | 輩  : 무리배 | 伯  : 맏백 | 煩  : 번거로울번 | 繁  : 번성할번 | 飜  : 번역할번 | 罰  : 벌할벌 | 凡  : 무릇범 | 碧  : 푸를벽 | 辨  : 분별할변 | 別  : 다를별 | 丙  : 남녘병 | 兵  : 병사병 | 屛  : 병풍병 | 竝  : 나란히병 | 補  : 기울보 | 譜  : 족보보 | 卜  : 점복 | 腹  : 배복 | 覆  : 엎을복 | 封  : 봉할봉 | 峯  : 봉우리봉 | 逢  : 만날봉 | 蜂  : 벌봉 | 鳳  : 새봉 | 付  : 부칠부 | 扶  : 도울부 | 附  : 붙을부 | 赴  : 다다를부 | 浮  : 뜰부 | 符  : 부호부 | 腐  : 썩을부 | 賦  : 부세부 | 簿  : 문서부 | 奔  : 달릴분 | 紛  : 어지러울분 | 墳  : 무덤분 | 奮  : 떨칠분 | 不  : 아닐불/부 | 拂  : 떨칠불 | 朋  : 벗붕 | 崩  : 무너질붕 | 妃  : 왕비비 | 肥  : 살찔비 | 卑  : 낮을비 | 祕  : 숨길비 | 婢  : 계집종비 | 碑  : 비석비 | 賓  : 손빈 | 頻  : 자주빈 | 聘  : 부를빙 | 巳  : 뱀사 | 史  : 사기사 | 司  : 맡을사 | 仕  : 섬길사 | 似  : 닮을사 | 沙  : 모래사 | 邪  : 간사할사 | 私  : 사사사 | 使  : 부릴사 | 社  : 모일사 | 祀  : 제사사 | 査  : 조사할사 | 思  : 생각사 | 捨  : 버릴사 | 蛇  : 긴뱀사 | 斜  : 비낄사 | 詐  : 속일사 | 詞  : 말사 | 斯  : 이사 | 賜  : 줄사 | 削  : 깍을삭 | 朔  : 초하루삭 | 山  : 메산 | 森  : 수풀삼 | 上  : 위상 | 尙  : 오히려상 | 狀  : 모양상 | 桑  : 뽕나무상 | 商  : 장사상 | 常  : 떳떳할상 | 祥  : 상서상 | 喪  : 잃을상 | 想  : 생각상 | 詳  : 자세할상 | 裳  : 치마상 | 嘗  : 맛볼상 | 像  : 모양상 | 霜  : 서리상 | 償  : 갚을상 | 塞  : 변방새 | 索  : 찿을색 | 書  : 글서 | 恕  : 용서할서 | 徐  : 천천할서 | 庶  :  여러서 | 敍  : 펼서 | 暑  : 더울서 | 署  : 마을서 | 誓  : 맹세할서 | 緖  : 실마리서 | 逝  : 갈서 | 昔  : 예석 | 析  : 쪼갤석 | 惜  : 아낄석 | 釋  : 풀석 | 旋  : 돌선 | 禪  : 선선 | 涉  : 건널섭 | 攝  : 다스릴섭 | 城  : 재성 | 盛  : 성할성 | 聖  : 성인성 | 世  : 인간세 | 勢  : 형세세 | 召  : 부를소 | 昭  : 밝을소 | 素  : 본디소 | 笑  : 웃음소 | 疏  : 소통할소 | 訴  : 호소할소 | 蔬  : 나물소 | 燒  : 사를소 | 蘇  : 되살아날소 | 騷  : 떠들소 | 粟  : 조속 | 屬  : 붙일속 | 訟  : 송사할송 | 頌  : 칭송할송 | 誦  : 욀송 | 刷  : 인쇄할쇄 | 鎖  : 쇠사슬쇄 | 衰  : 쇠할쇠 | 囚  : 가둘수 | 垂  : 드리울수 | 帥  : 장수수 | 殊  : 다를수 | 搜  : 찾을수 | 須  : 모름지기수 | 遂  : 드디어수 | 愁  : 근심수 | 睡  : 졸음수 | 需  : 쓰일수 | 壽  : 목숨수 | 隨  : 따를수 | 誰  : 누구수 | 數  : 셀수 | 輸  : 보낼수 | 雖  : 비록수 | 獸  : 짐승수 | 淑  : 맑을숙 | 孰  : 누구숙 | 熟  : 익을숙 | 旬  : 열흘순 | 巡  : 돌순 | 殉  : 따라죽을순 | 脣  : 입술순 | 循  : 돌순 | 瞬  : 눈깜작일순 | 戌  : 개술 | 述  : 펼술 | 拾  : 주을습,열십 | 濕  : 젖을습 | 襲  : 엄습할습 | 承  : 이을승 | 昇  : 오를승 | 乘  : 탈승 | 僧  : 중승 | 市  : 저자시 | 矢  : 화살시 | 侍  : 모실시 | 始  : 비로소시 | 是  : 이시 | 食  : 밥식 | 飾  : 꾸밀식 | 申  : 납신 | 辛  : 매울신 | 伸  : 펼신 | 晨  : 새벽신 | 愼  : 삼갈신 | 新  : 새신 | 甚  : 심할심 | 尋  : 찾을심 | 審  : 살필심 | 雙  : 두쌍 | 氏  : 각시씨 | 牙  : 어금니아 | 芽  : 싹아 | 我  : 나아 | 亞  : 버금아 | 阿  : 언덕아 | 雅  : 맑을아 | 餓  : 주릴아 | 岳  : 큰산악 | 岸  : 언덕안 | 雁  : 기러기안 | 顔  : 낯안 | 謁  : 뵐알 | 岩  : 바위암 | 押  : 누를압 | 央  : 가운데앙 | 仰  : 우러를앙 | 殃  : 재앙앙 | 哀  : 슬플애 | 涯  : 물가애 | 厄  : 액액 | 也  : 이끼야 | 耶  : 어조사야 | 若  : 같을약 | 約  : 맺을약 | 躍  : 뛸약 | 揚  : 날릴양 | 楊  : 버들양 | 壤  : 흙덩이양 | 讓  : 사양할양 | 於  : 어조사어 | 魚  : 물고기어 | 御  : 거느릴어 | 抑  : 누를억 | 憶  : 생각할억 | 焉  : 어찌언 | 予  : 나여 | 汝  : 너여 | 余  : 나여 | 與  : 더불여 | 輿  : 수레여 | 亦  : 또역 | 役  : 부릴역 | 疫  : 전염병역 | 譯  : 번역할역 | 驛  : 역역 | 沿  : 물따라갈연 | 宴  : 잔치연 | 演  : 펼연 | 燕  : 제비연 | 悅  : 기쁠열 | 閱  : 볼열 | 炎  : 불꽃염 | 染  : 물들염 | 鹽  : 소금염 | 泳  : 헤엄칠영 | 映  : 비칠영 | 詠  : 읊을영 | 榮  : 영화영 | 影  : 그림자영 | 銳  : 날카로울예 | 藝  : 재주예 | 譽  : 기릴예 | 汚  : 더러울오 | 吾  : 나오 | 烏  : 까마귀오 | 悟  : 깨달을오 | 娛  : 즐길오 | 嗚  : 슬플오 | 傲  : 거만할오 | 玉  : 구슬옥 | 獄  : 옥옥 | 翁  : 늙은이옹 | 擁  : 낄옹 | 瓦  : 기와와 | 臥  : 누울와 | 緩  : 느릴완 | 曰  : 가로왈 | 外  : 바깥외 | 畏  : 두려워할외 | 要  : 요긴할요 | 搖  : 흔들요 | 遙  : 멀요 | 腰  : 허리요 | 辱  : 욕될욕 | 欲  : 하고자할욕 | 慾  : 욕심욕 | 庸  : 떳떳할용 | 又  : 또우 | 于  : 어조사우 | 尤  : 더욱우 | 宇  : 집우 | 羽  : 깃우 | 偶  : 짝우 | 愚  : 어리석을우 | 憂  : 근심우 | 云  : 이를운 | 運  : 옮길운 | 韻  : 운운 | 原  : 언덕원 | 院  : 집원 | 越  : 넘을월 | 胃  : 밥통위 | 圍  : 에워쌀위 | 違  : 어긋날위 | 僞  : 거짓위 | 緯  : 씨위 | 謂  : 이를위 | 幼  : 어릴유 | 酉  : 닭유 | 柔  : 부드러울유 | 幽  : 그윽할유 | 唯  : 오직유 | 惟  : 생각할유 | 猶  : 오히려유 | 裕  : 넉넉할유 | 愈  : 나을유 | 維  : 벼리유 | 誘  : 꾈유 | 閏  : 윤달윤 | 潤  : 불을윤 | 隱  : 숨을은 | 乙  : 새을 | 吟  : 읊을음 | 淫  : 음란할음 | 泣  : 울읍 | 凝  : 엉길응 | 矣  : 어조사의 | 宜  : 마땅의 | 已  : 이미이 | 而  : 말이을이 | 夷  : 오랑캐이 | 翼  : 날개익 | 忍  : 참을인 | 姻  : 혼인인 | 寅  : 범인 | 逸  : 편안할일 | 壬  : 북방임 | 賃  : 품삯임 | 入  : 들입 | 刺  : 찌를자/척 | 玆  : 이자 | 恣  : 방자할자 | 紫  : 자주빛자 | 慈  : 사랑자 | 酌  : 술부을작 | 爵  : 벼슬작 | 暫  : 잠깐잠 | 潛  : 잠길잠 | 丈  : 어른장 | 莊  : 씩씩할장 | 掌  : 손바닥장 | 葬  : 장사지낼장 | 粧  : 단장할장 | 獎  : 장려할장 | 障  : 막을장 | 藏  : 감출장 | 臟  : 오장장 | 墻  : 담장 | 再  : 두재 | 哉  : 어조사재 | 宰  : 재상재 | 栽  : 심을재 | 裁  : 옷마를재 | 載  : 실을재 | 抵  : 막을저 | 著  : 나타날저 | 寂  : 고요할적 | 笛  : 피리적 | 跡  : 발자취적 | 滴  : 물방울적 | 摘  : 딸적 | 適  : 맞을적 | 績  : 길쌈적 | 蹟  : 자취적 | 全  : 온전할전 | 電  : 번개전 | 殿  : 전각전 | 戰  : 싸움전 | 竊  : 훔칠절 | 漸  : 점점점 | 接  : 이을접 | 蝶  : 나비접 | 丁  : 장정정 | 井  : 우물정 | 廷  : 조정정 | 征  : 칠정 | 亭  : 정자정 | 貞  : 곧을정 | 訂  : 바로잡을정 | 頂  : 정수리정 | 淨  : 깨끗할정 | 程  : 한도정 | 制  : 절제할제 | 堤  : 둑제 | 齊  : 가지런할제 | 際  : 즈음제 | 諸  : 모두제 | 弔  : 조상할조 | 早  : 이를조 | 兆  : 억조조 | 祖  : 할아비조 | 租  : 조세조 | 組  : 짤조 | 照  : 비칠조 | 潮  : 조수조 | 燥  : 마를조 | 卒  : 마칠졸 | 拙  : 졸할졸 | 縱  : 세로종 | 鍾  : 쇠북종 | 坐  : 앉을좌 | 佐  : 도울좌 | 舟  : 배주 | 宙  : 집주 | 洲  : 물가주 | 柱  : 기둥주 | 奏  : 아뢸주 | 株  : 그루주 | 珠  : 구슬주 | 週  : 주일주 | 鑄  : 쇠불릴주 | 俊  : 준걸준 | 遵  : 좇을준 | 仲  : 버금중 | 卽  : 곧즉 | 症  : 증세증 | 曾  : 일찍증 | 蒸  : 찔증 | 增  : 더할증 | 憎  : 미울증 | 贈  : 보낼증 | 之  : 갈지 | 支  : 지탱할지 | 只  : 다만지 | 枝  : 가지지 | 池  : 못지 | 指  : 가리킬지 | 智  : 지혜지 | 遲  : 더딜지 | 職  : 직분직 | 辰  : 별진 | 振  : 떨칠진 | 陳  : 베풀진 | 震  : 우레진 | 鎭  : 진압할진 | 姪  : 조카질 | 疾  : 병질 | 秩  : 차례질 | 執  : 잡을집 | 徵  : 부를징 | 懲  : 징계할징 | 且  : 또차 | 此  : 이차 | 差  : 다를차 | 借  : 빌릴차 | 捉  : 잡을착 | 錯  : 어긋날착 | 贊  : 도울찬 | 參  : 참여할참 | 慘  : 참혹할참 | 慙  : 부끄러울참 | 昌  : 창성할창 | 倉  : 곳집창 | 唱  : 부를창 | 蒼  : 푸를창 | 暢  : 화창할창 | 菜  : 나물채 | 彩  : 채색채 | 債  : 빚채 | 策  : 꾀책 | 妻  : 아내처 | 處  : 곳처 | 尺  : 자척 | 斥  : 물리칠척 | 拓  : 넓힐척 | 戚  : 친척척 | 淺  : 얕을천 | 踐  : 밟을천 | 賤  : 천할천 | 遷  : 옮길천 | 薦  : 천거할천 | 哲  : 밝을철 | 徹  : 통할철 | 尖  : 뽀족할첨 | 添  : 더할첨 | 妾  : 첩첩 | 晴  : 갤청 | 逮  : 잡을체 | 替  : 바꿀체 | 遞  : 갈릴체 | 滯  : 막힐체 | 肖  : 닮을초 | 抄  : 뽑을초 | 秒  : 분노초 | 超  : 뛰어넘을초 | 礎  : 주춧돌초 | 促  : 재촉할촉 | 燭  : 촛불촉 | 觸  : 닿을촉 | 聰  : 귀밝을총 | 總  : 다총 | 催  : 재촉할최 | 抽  : 뽑을추 | 追  : 쫓을추 | 醜  : 추할추 | 丑  : 소축 | 畜  : 짐승축 | 逐  : 쫓을축 | 充  : 채울충 | 衝  : 찌를충 | 吹  : 불취 | 取  : 가질취 | 就  : 나아갈취 | 醉  : 취할취 | 側  : 곁측 | 値  : 값치 | 恥  : 부끄러울치 | 稚  : 어릴치 | 則  : 법칙 | 漆  : 옻칠 | 沈  : 잠길침 | 枕  : 베개침 | 侵  : 침노할침 | 浸  : 잠길침 | 寢  : 잘침 | 妥  : 온당할타 | 墮  : 떨어질타 | 托  : 맡길탁 | 濁  : 흐릴탁 | 濯  : 씻을탁 | 誕  : 낳을탄 | 奪  : 빼앗을탈 | 貪  : 탐낼탐 | 塔  : 탑탑 | 湯  : 끓일탕 | 怠  : 게으를태 | 殆  : 거의태 | 泰  : 클태 | 態  : 모습태 | 宅  : 집택/댁 | 澤  : 못택 | 吐  : 토할토 | 兎  : 토끼토 | 透  : 사무칠투 | 頗  : 자못파 | 罷  : 마칠파 | 播  : 뿌릴파 | 把  : 잡을파 | 判  : 판단할판 | 板  : 널판 | 版  : 판목판 | 販  : 팔판 | 貝  : 조개패 | 片  : 조각편 | 偏  : 치우칠편 | 遍  : 두루편 | 編  : 엮을편 | 肺  : 허파폐 | 廢  : 폐할폐 | 蔽  : 덮을폐 | 弊  : 폐단폐 | 幣  : 화폐폐 | 抱  : 안을포 | 怖  : 두려워할포 | 浦  : 개포 | 捕  : 잡을포 | 飽  : 배부를포 | 幅  : 폭폭 | 暴  : 사나울폭 | 爆  : 불터질폭 | 漂  : 떠다닐표 | 楓  : 단풍풍 | 皮  : 가죽피 | 彼  : 저피 | 疲  : 피곤할피 | 被  : 입을피 | 匹  : 짝필 | 畢  : 마칠필 | 何  : 어찌하 | 河  : 물하 | 荷  : 멜하 | 賀  : 하례할하 | 鶴  : 학학 | 汗  : 땀한 | 旱  : 가물한 | 恨  : 한한 | 限  : 한할한 | 漢  : 한나라한 | 韓  : 나라한 | 割  : 벨할 | 含  : 머금을함 | 咸  : 다함 | 陷  : 빠질함 | 巷  : 거리항 | 恒  : 항상항 | 項  : 목항 | 亥  : 돼지해 | 害  : 해할해 | 奚  : 어찌해 | 該  : 갖출해 | 行  : 다닐행 | 享  : 누릴향 | 響  : 울릴향 | 軒  : 집헌 | 獻  : 드릴헌 | 玄  : 검을현 | 絃  : 줄현 | 縣  : 고을현 | 懸  : 달현 | 穴  : 굴혈 | 嫌  : 싫어할혐 | 協  : 화할협 | 脅  : 위협할협 | 亨  : 형통할형 | 螢  : 반딧불형 | 衡  : 저울대형 | 兮  : 어조사혜 | 慧  : 슬기로울혜 | 戶  : 집호 | 互  : 서로호 | 乎  : 어조사호 | 虎  : 범호 | 胡  : 되호 | 浩  : 넓을호 | 毫  : 터럭호 | 號  : 이름호 | 豪  : 호걸호 | 護  : 도울호 | 或  : 혹혹 | 惑  : 미혹할혹 | 昏  : 어두울혼 | 魂  : 넋혼 | 忽  : 갑자기홀 | 弘  : 클홍 | 洪  : 넓을홍 | 鴻  : 기러기홍 | 禾  : 벼화 | 話  : 말씀화 | 禍  : 재앙화 | 擴  : 넓힐확 | 穫  : 거둘확 | 丸  : 둥글환 | 換  : 바꿀환 | 還  : 돌아올환 | 歡  : 기쁠환 | 皇  : 임금황 | 荒  : 거칠황 | 回  : 돌아올회 | 悔  : 뉘우칠회 | 懷  : 품을회 | 劃  : 그을획 | 獲  : 얻을획 | 橫  : 가로횡 | 曉  : 새벽효 | 侯  : 제후후 | 毁  : 헐훼 | 輝  : 빛날휘 | 携  : 이끌휴 | 烋  : 아름다울휴 | 胸  : 가슴흉 | 興  : 일흥 | 稀  : 드물희 | 戱  : 놀희 |


*** 오늘의한자
    #+BEGIN_SRC emacs-lisp
      (let* ((days (time-to-day-in-year (current-time)))
             (mod (/ (length hanja-grade3) 3))
             (hit (% days  mod))
             (hit-1 (% (- days 1)  mod)))

        (setf today-hanja3
              (s-join ";  "
                      (list  (nth hit hanja-grade3)
                             (nth (+ mod hit) hanja-grade3)
                             (nth (+ mod mod hit) hanja-grade3))
                      ))

        (setf today-hanja4
              (s-join ";  "
                      (list
                       (nth hit hanja-grade4)
                       (nth (+ mod hit) hanja-grade4)
                       (nth (+ mod mod hit) hanja-grade4)
                       (nth (+ mod mod mod hit) hanja-grade4))))

        (setf yesterday-hanja3
              (s-join ";  "
                      (list  (nth hit-1 hanja-grade3)
                             (nth (+ mod hit-1) hanja-grade3)
                             (nth (+ mod mod hit-1) hanja-grade3))
                      ))

        (setf yesterday-hanja4
              (s-join ";  "
                      (list
                       (nth hit-1 hanja-grade4)
                       (nth (+ mod hit-1) hanja-grade4)
                       (nth (+ mod mod hit-1) hanja-grade4)
                       (nth (+ mod mod mod hit-1) hanja-grade4))))

        )

      (spacemacs-buffer/warning
       (today-message "어제의 한자 3급 %s" yesterday-hanja3))

      (spacemacs-buffer/warning
       (today-message "어제의 한자 4급 %s" yesterday-hanja4))


      (spacemacs-buffer/warning
       (today-message "오늘의 한자 3급 %s" today-hanja3))

      (spacemacs-buffer/warning
       (today-message "오늘의 한자 4급 %s" today-hanja4))

    #+END_SRC

    #+RESULTS:
    | Cannot find any of the specified fonts (Source Code Pro)! Font settings may not be correct. | More than one init function found for package helm-make. Previous owner was helm, replacing it with layer ivy. | Auto-evilication could not remap these functions in map `elfeed-search-mode-map': |
 

* alarm
       #+BEGIN_SRC emacs-lisp

         (let* ((ct (decode-time (current-time)))
                (ctm (+  (cadr ct) (* 60 (caddr ct)))))
           (if (not (> ctm (+ (* 10  60 ) 0  ))) (myalarm "10:00" (format "휴식하시요. %s\n%s\n%s" today-katakana today-hanja3 today-hanja4)))
           (if (not (> ctm (+ (* 15  60 ) 0  ))) (myalarm "15:00" (format "휴식하시요. %s\n%s\n%s" today-katakana today-hanja3 today-hanja4)))
           (if (not (> ctm (+ (* 18  60 ) 10 ))) (myalarm "18:10" (format "퇴근하시요. %s\n%s\n%s" today-katakana today-hanja3 today-hanja4)))
           (if (not (> ctm (+ (* 19  60 ) 20 ))) (myalarm "19:20" (format "퇴근하시요. %s\n%s\n%s" today-katakana today-hanja3 today-hanja4)))
           (if (not (> ctm (+ (* 20  60 ) 20 ))) (myalarm "21:20" (format "퇴근하시요. %s\n%s\n%s" today-katakana today-hanja3 today-hanja4))))
       #+END_SRC

       #+RESULTS:
       : [nil 22698 57072 0 nil alarm-clock-message ("퇴근하시요. チャ;cha;차") nil 0]
